//////////////1、有 1、2、3、4 四个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
//////////////#include <stdio.h>
//////////////#include <math.h>
//////////////void dg(int n);//函数声明（初始化）
//////////////void dg(int n)//函数定义
//////////////{										//cxl即程序流从dg(4)一直跑到dg(1)一直分配内存，当dg(1)不满足if条件时
//////////////										//dg(1)执行完，又因为dg(1)在dg(2)里面所以dg(2)也执行完，同理这样逐级返回
//////////////									//cxl程序流又从dg(1)一直返回到dg(4)，dg(4)执行完再回到mian函数里面，在不断释放内存
//////////////	printf("1: n= %d\n",n);				//该函数从dg(4)  -->  dg(3)-->  dg(2)-->dg(1)
//////////////	if (n > 1)
//////////////	{
//////////////		dg(n - 1);
//////////////	}
//////////////	printf("2：n=%d\n", n);
//////////////
//////////////}
////////////
////////////
//////////////void jc(int n);//函数声明
//////////////void jc(int n)//函数定义
//////////////{
//////////////	int i, sum;
//////////////	sum = 1;
//////////////	for (i = 1; i <= n; i++)
//////////////	{
//////////////		sum = sum * i;
//////////////	}
//////////////	return sum;
//////////////}
////////////int main(void)
////////////{
////////////	/*
////////////	int i, j, k;//分别代表十位百位个位
////////////	printf("\n");
////////////	//以下为3重循环
////////////	for (i = 1; i < 5; i++)//每一位都可以用1到4来表示
////////////	{
////////////		for (j = 1; j < 5; j++)
////////////		{
////////////			for (k = 1; k < 5; k++)
////////////			{
////////////				//确保i,j,k,三位互不相同
////////////				if (i != k && i != j && j != k)//三个数两两之间不能互相相等重复
////////////				{
////////////					printf("%d,%d,%d\n", i, j, k);
////////////				}
////////////			}
////////////		}
////////////	}
////////////	*/
////////////
////////////	/*2、企业发放的奖金根据利润提成。
////////////	利润(I)低于或等于10万元时，奖金可提10% ；
////////////	利润高于10万元，低于20万元时，低于10万元的部分按10% 提成，高于10万元的部分，可提成7.5 % ；
////////////	20万到40万之间时，高于20万元的部分，可提成5 % ；
////////////	40万到60万之间时高于40万元的部分，可提成3 % ；
////////////	60万到100万之间时，高于60万元的部分，可提成1.5 % ；
////////////	高于100万元时，超过100万元的部分按1 % 提成。
////////////	从键盘输入当月利润I，求应发放奖金总数？
////////////	*/
////////////	/*
////////////	printf("请输入当月利润\n");
////////////	double  i;//净利润
////////////	double bonus10,bonus20,bonus40,bonus60,bonus100,bonus;//奖金
////////////	scanf_s("%lf",&i);
////////////	bonus10 = 100000* 0.1;//i<=20的基础部分
////////////	bonus20 = bonus10 + 100000 * 0.075;//i<=40的基础部分
////////////	bonus40 = bonus20 + 100000 * 0.05;//i<=60的基础部分
////////////	bonus60 = bonus40 + 100000 * 0.03;
////////////	bonus100 = bonus60 + 100000 * 0.015;
////////////	if (i <= 100000)
////////////	{
////////////		bonus = i * 0.1;
////////////	}
////////////	else if (i <= 200000)
////////////	{
////////////		bonus = bonus10 + (i - 100000) * 0.075;
////////////	}
////////////	else if (i <= 400000)
////////////	{
////////////		bonus = bonus20 + (i - 200000) * 0.05;
////////////	}
////////////	else if (i <= 600000)
////////////	{
////////////		bonus = bonus40 + (i - 400000) * 0.03;
////////////	}
////////////	else if (i <= 1000000)
////////////	{
////////////		bonus = bonus60 + (i - 600000) * 0.015;
////////////	}
////////////	else if (i > 1000000)
////////////	{
////////////		bonus = bonus100 + (i - 1000000) * 0.01;
////////////	}
////////////	printf("奖金=%lf元\n", bonus);
////////////	*/
////////////
////////////	/*一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
////////////	完全平方数：一个数能表示成某个整数的平方的形式*/
////////////	/*
////////////int i, j, m, n, x;//假设该数为 x
////////////for (i = 1; i < 168 / 2 + 1; i++)
////////////{
////////////	if (168 % i == 0)
////////////	{
////////////		j = 168 / i;
////////////		if (i > j && (i + j) % 2 == 0 && (i - j) % 2 == 0)
////////////		{
////////////			m = (i + j) / 2;
////////////			n = (i - j) / 2;
////////////			x = n * n - 100;
////////////			printf("%d+100=%d*%d\n", x, n, n);
////////////			printf("%d+268=%d*%d\n", x, m, m);
////////////			printf("************\n");
////////////		}
////////////
////////////	}
////////////}
////////////*/
////////////
//////////////输入某年某月某日，判断这一天是这一年的第几天？
/////////////*
////////////	int year, month, day, sum, leap;
////////////	printf("\n请输入年，月，日，格式为：年，月，日（2015，12，10）\n");
////////////	scanf_s("%d,%d,%d", &year, &month, &day);
////////////	//格式为：2015，12，10
////////////	switch (month)//先计算某月以前月份的总天数
////////////	{
////////////	case 1:sum = 0; break;
////////////	case 2:sum = 31; break;
////////////	case 3:sum = 59; break;
////////////	case 4:sum = 90; break;
////////////	case 5:sum = 120; break;
////////////	case 6:sum = 151; break;
////////////	case 7:sum = 181; break;
////////////	case 8:sum = 212; break;
////////////	case 9:sum = 243; break;
////////////	case 10:sum = 273; break;
////////////	case 11:sum = 304; break;
////////////	case 12:sum = 334; break;
////////////	default: printf("data error"); break;
////////////	}
////////////	sum = sum + day;//再加上某天的天数
////////////	if (year % 400 == 0 || (year % 4 == 0 && year % 100 != 0)) //判断是不是闰年
////////////	{
////////////		leap = 1;
////////////	}
////////////	else
////////////	{
////////////		leap = 0;
////////////	}
////////////	if (leap == 1 && month > 2)
////////////	{
////////////		//如果是闰年且月份大于2总天数应该加一天
////////////		sum++;
////////////	}
////////////	printf("这是这一年的第%d天", sum);
////////////	printf("\n");
////////////*/
//////////////输入三个整数x,y,z，请把这三个数由小到大输出。
/////////////*
////////////int x, y, z,t;
////////////printf("请输入三个数\n");
////////////scanf_s("%d,%d,%d", &x, &y, &z);
////////////if (x>y )//交换x,y的值
////////////{
////////////	t = x;
////////////	x = y;//因为第一个输入值默认是X所以当x>y时应该将y赋值给x
////////////	y = t;
////////////}
////////////else if (x > z)//交换x,z的值
////////////{
////////////	t = x;
////////////	x = z;//因为第一个输入值默认是X所以当x>z时应该将z赋值给x
////////////	z = t;
////////////}
////////////else if (y > z)//交换y,z的值
////////////{
////////////	t = y;
////////////	x = z;//因为第一个输入值默认是X所以当y>z时应该将z赋值给x
////////////	z = t;
////////////}
////////////	printf("x,y,z从小到大排序为%d,%d,%d\n", x, y, z);
////////////*/
////////////
/////////////*用*号输出字母C的图案。*/
/////////////*
////////////printf("****\n");
////////////printf("*\n");
////////////printf("*\n");
////////////printf("****\n");
////////////*/
////////////
/////////////*输出特殊图案，请在c环境中运行，看一看，Very Beautiful!*/
//////////////显示不了是因为windows运行环境的问题修改为OEM-美国即可，这里就不修改了
/////////////*
////////////char a = 176, b = 219;
////////////printf("%c%c%c%c%c\n", b, a, a, a, b);
////////////printf("%c%c%c%c%c\n", a, b, a, b, a);
////////////printf("%c%c%c%c%c\n", a, a, b, a, a);
////////////printf("%c%c%c%c%c\n", a, b, a, b, a);
////////////printf("%c%c%c%c%c\n", b, a, a, a, b);
////////////*/
/////////////*输出9*9口诀。*/
//////////////分行与列考虑，共 9 行 9 列，i 控制行，j 控制列。
/////////////*
////////////int i, j, result;
////////////printf("\n");
//////////////for循环嵌套也就是当第一个循环i=1的时候下面的for循环会先逐次跑完，再返回到最大的循环跑第二次
////////////for (i = 1; i < 10; i++)//i从1到9，共9行
////////////{
////////////	for (j = 1; j <= i; j++)//j从1到i共i列
////////////	{
////////////		result = i * j;
////////////		printf("%d,%d=%-3d",i,j,result);//-3d表示左对齐占3位
////////////	}
////////////	printf("\n");
////////////}
////////////*/
////////////
/////////////*要求输出国际象棋棋盘。
////////////程序分析：国际象棋棋盘由64个黑白相间的格子组成，
////////////分为8行*8列。用i控制行，j来控制列，根据i+j的和
////////////的变化来控制输出黑方格，还是白方格。*/
////////////
/////////////*int i, j, sum;
////////////	for (i = 0; i < 8; i++)
////////////	{
////////////			for (j = 0; j < 8; j++)
////////////			{
////////////				if ((i + j) % 2 == 0)
////////////				{
////////////					printf("%c%c", 219, 219);
////////////				}
////////////				else
////////////				{
////////////					printf("  ");
////////////				}
////////////			}
////////////			printf("\n");
////////////	}
////////////*/
/////////////*打印楼梯，同时在楼梯上方打印两个笑脸。
////////////
////////////程序分析：用 ASCII 1 来输出笑脸；用i控制行，j来控制列，j根据i的变化来控制输出黑方格的个数。
////////////
////////////如果出现乱码情况请参考【C 练习实例7】的解决方法。*/
/////////////*int i, j;
////////////printf("\1\1\n");//输出两个笑脸
////////////for (i = 1; i < 11; i++)
////////////{
////////////	for (j = 1; j <= i; j++)
////////////		printf("%c%c", 219, 219);
////////////	printf("\n");
////////////}
////////////*/
/////////////*古典问题（兔子生崽）：有一对兔子，从出生后第3个月起每个月都生一对兔子,//斐波那契数列
////////////小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？（输出前40个月即可）
////////////递归问题
////////////程序分析：兔子的规律为数列1,1,2,3,5,8,13,21....，即下个月是上两个月之和（从第三个月开始）。
////////////当月份小于等于 2 时，兔子对数为 1；当月份大于 2 时，兔子对数为上个月的兔子对数加上上上个月的兔子对数。
////////////递归函数的终止条件是月份等于 1 或 2。*/
////////////
/////////////*
////////////#include <stdio.h>
////////////
////////////int rabbit(int n) //创建rabbit递归函数传入参数第n个月
////////////{
////////////	if (n == 1 || n == 2) //在第一个月或者第二个月时候返回值为1
////////////	{
////////////
////////////		return 1;
////////////
////////////	}
////////////	else //否则返回除去第1，2个月剩下的值
////////////	{
////////////
////////////		return rabbit(n - 1) + rabbit(n - 2);//这里rabbit自己调用自己
////////////
////////////	}
////////////
////////////}
////////////
////////////int main()
////////////{
////////////
////////////	int n;
////////////
////////////	printf("请输入月份：");
////////////
////////////	scanf_s("%d", &n);
////////////
////////////	printf("第%d个月时有%d对兔子\n", n, rabbit(n));//这里调用递归函数
////////////
////////////	return 0;
////////////}
////////////*/
////////////
/////////////*判断 101 到 200 之间的素数。
////////////
////////////程序分析：判断素数的方法：用一个数分别去除 2 到 sqrt(这个数)求根号，如果能被整除，则表明此数不是素数，反之是素数。*/
/////////////*int count=0, i, j;
////////////for (i = 101; i < 200; i++)
////////////{
////////////	for (j = 2; j < i; j++)
////////////	{
////////////		//如果j能够被i整除再跳出循环
////////////		if (i % j == 0)
////////////			break;
////////////	}
////////////	// 判断循环是否提前跳出，如果 j<i 说明在 2~j 之间,i 有可整除的数
////////////	if (j >=i)
////////////	{
////////////		count++;
////////////			printf("%d\n", i);
////////////		//用count计数每5个换行
////////////			if (count % 5 == 0)
////////////				printf("\n");
////////////	}
////////////}*/
////////////
//////////////有 1、2、3、4 四个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
//////////////重点三位数，可以用个位，十位，百位来表示，可以用三重循环来查找，最后再去掉重复的部分
//////////////int ge, shi, bai;
//////////////for (ge = 1; ge < 5; ge++)
//////////////{
//////////////	for (shi = 1; shi < 5; shi++)
//////////////	{
//////////////		for (bai = 1; bai < 5; bai++)
//////////////		{
//////////////			if (ge != shi && shi != bai && ge != bai)
//////////////			{
//////////////				printf("%d%d%d\n",ge, shi, bai);
//////////////			}
//////////////		}
//////////////
//////////////	}
//////////////}
/////////////*企业发放的奖金根据利润提成。
////////////
////////////利润(I)低于或等于10万元时，奖金可提10%；
////////////利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
////////////20万到40万之间时，高于20万元的部分，可提成5%；
////////////40万到60万之间时高于40万元的部分，可提成3%；
////////////60万到100万之间时，高于60万元的部分，可提成1.5%；
////////////高于100万元时，超过100万元的部分按1%提成。
////////////从键盘输入当月利润I，求应发放奖金总数？
////////////*/
//////////////double i,month10,month20,month40,month60,month100,month;//i表示当月利润month表示奖金
//////////////printf("请输入当月利润\n");
//////////////scanf_s("%lf",&i);
////////////////基础部分
//////////////month10 = 100000 * 0.1;
//////////////month20 = month10+100000 * 0.075;
//////////////month40 = month20 +200000* 0.05;
//////////////month60 = month40 +200000* 0.03;
//////////////month100 = month60 +400000 * 0.015;//高的部分*百分比
//////////////if (i <= 100000)
//////////////{
//////////////	month = month10;
//////////////}
//////////////else if (i <= 200000)
//////////////{
//////////////	month = month10 + (i - 100000) * 0.075;
//////////////}
//////////////else if (i <= 400000)
//////////////{
//////////////	month = month20 + (i - 200000) * 0.05;
//////////////}
//////////////
//////////////else if (i <= 600000)
//////////////{
//////////////	month = month40 + (i - 400000) * 0.03;
//////////////}
//////////////
//////////////else if (i <= 1000000)
//////////////{
//////////////	month = month60 + (i - 600000) * 0.015;
//////////////}
//////////////else if (i > 1000000)
//////////////{
//////////////	month = month100 + (i - 1000000) * 0.01;
//////////////}
//////////////
//////////////printf("当月应得奖金为%lf",month);
//////////////printf("\n");
////////////
/////////////*输入三个整数x,y,z，请把这三个数由小到大输出。*/
//////////////int x, y, z,t;
//////////////printf("请输入三个数\n");
//////////////scanf_s("%d,%d,%d",&x,&y,&z);
//////////////if (x > y)
//////////////{
//////////////	t = x;
//////////////	x = y;
//////////////	y= t;
//////////////}
//////////////if (x > z)
//////////////{
//////////////	t = x;
//////////////	x = z;
//////////////	z = t;
//////////////}
//////////////
//////////////if (y > z)
//////////////{
//////////////	t = y;
//////////////	y = z;
//////////////	z = t;
//////////////}
//////////////printf("三个数从小到大依次为%d,%d,%d",x,y,z);
//////////////三个数找最大值
//////////////int a, b,c, max;
//////////////printf("请输入三个数\n");
//////////////scanf_s("%d,%d,%d,",&a,&b,&c);
//////////////max = a;
//////////////if (max < b)
//////////////{
//////////////	max = b;
//////////////	if (max < c)
//////////////	{
//////////////		max = c;
//////////////	}
//////////////}
//////////////printf("三个数的最大值为%d",max);
////////////
//////////////水仙花数
////////////// 定义一个三位数i它的百位十位个位分别为a,b,c。若是i=a^3+b^3+c^3那么该数称为水仙花数。
//////////////输出100 - 999以内的水仙花数
//////////////int i;
//////////////int a, b, c;
//////////////	for (i = 100; i < 1000; i++)//100-999循环
//////////////	{
//////////////		a = i / 100;//百位
//////////////		b = (i - 100*a) / 10;//十位
//////////////		c = i - 100 * a - 10 * b;//个位
//////////////		if (i==a* a* a+ b* b* b+ c* c *c)
//////////////			printf("i=%d\t",i);//\t 转义字符，水平制表相当于Tab
//////////////	}
/////////////*当一个函数自己调用自己称为递归*/
//////////////递归在单片内用的非常少
//////////////因为递归算法调用的变量在内存中不释放，非常占用内存
//////////////函数递归调用必须放if里面有终止条件的，不能让他一直跑下去
////////////
//////////////位于递归调用前的语句，执行顺序与调用相同(递代码)
//////////////位于递归调用后的语句，执行顺序与调用相反(归代码)
//////////////特点很浪费空间   不断地分配空间
////////////// 很浪费时间      不断地调用函数
//////////////解决一个问题时，不断简化，直到问题解决
//////////////dg(4);//函数调用
//////////////printf("ok\n");
////////////
//////////////for循环求阶乘
//////////////jc(5);//函数调用
//////////////递归求阶乘
//////////////写递归函数考虑如何递
////////////			  //如何归
////////////
////////////
////////////	/*char a, b;
////////////	char we[20];*/
////////////	//scanf_s("%s",we,8);
////////////	//rewind(stdin);//清空缓冲区
////////////	//scanf_s("%s",&b,5);
////////////	//rewind(stdin);//清空缓冲区
////////////	//printf("we = %s\n",we);
////////////	//printf("a=%c\nb=%c\n", a, b);
////////////	//gets(we);
////////////	//scanf_s("%s",we,8);
////////////	//puts(we);
////////////	//a = getchar();
////////////	//putchar(a);
////////////	//printf("we = %s\na=%c\n",we,a);
////////////
//////////////int a = 6,b=4;
//////////////float c = 4.2;
//////////////printf("%d",a%(int)c);//这里C以int类型来运算,但是强转不改变数据类型变量c还是float类型
//////////////printf("%f",a*c);//这里会低精度往高精度隐形转换所以用%f
//////////////int char 都是以补码形式存的可以用补码形式来读
//////////////注意printf是先从后往前运算，再从前往后执行，且不会重复运算
////////////
//////////////三个数排序从小到大
//////////////int a, b, c, t;
//////////////printf("请输入三个数\n");
//////////////scanf_s("%d,%d,%d,",&a,&b,&c);
//////////////if (a > b)
//////////////{
//////////////	t = a;
//////////////	a = b;
//////////////	b = t;
//////////////}
//////////////if (a > c)
//////////////{
//////////////	t = a;
//////////////	a = c;
//////////////	c = t;
//////////////}
//////////////if (b > c)
//////////////{
//////////////	t = b;
//////////////	b = c;
//////////////	c = t;
//////////////
//////////////}
//////////////printf("三个数从小到大依次为\na=%d\nb=%d\nc=%d",a,b,c);
////////////
/////////////*打印出100-999内所有的"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该数 本身。
////////////例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。
////////////程序分析：利用for循环控制100-999个数，每个数分解出个位，十位，百位。*/
//////////////int a, b, c;
//////////////int i;
//////////////for (i = 100; i < 1000; i++)
//////////////{
//////////////	a = i / 100;//百位,例如i=520,a=5
//////////////	b = (i - 100 * a) / 10;//十位,b=2
//////////////	c = i - 100 * a - 10 * b;//个位,c=0
//////////////	if(i==a*a*a+b*b*b+c*c*c)
//////////////	printf("i=%d\n",i);
//////////////}
////////////
/////////////*将一个正整数分解质因数。例如：输入90,打印出90=2*3*3*5。
////////////
////////////程序分析：对n进行分解质因数，应先找到一个最小的质数k，然后按下述步骤完成：
////////////
////////////(1)如果这个质数恰等于（小于的时候，继续执行循环）n，则说明分解质因数的过程已经结束，另外 打印出即可。
////////////(2)但n能被k整除，则应打印出k的值，并用n除以k的商,作为新的正整数n.重复执行第二步。
////////////(3)如果n不能被k整除，则用k+1作为k的值,重复执行第一步。*/
////////////
/////////////*质因数就是能够被该正整数整除的数（除它本身和1外）.比如像8,它的质因数就有2,2，2.
////////////16,就有2,2,2，2.每个数,1和它本身都是它的因数.
////////////而质因数却不是每个数都有的,像3,5,7,11就没有质因数.*/
//////////////int number;//表示输入正整数
//////////////int i;//设质数为i
//////////////printf("请输入一个数\n");
//////////////scanf_s("%d",&number);
//////////////
//////////////	for (i = 2; i <= number; i++)//i从2开始一直到number
//////////////	{
//////////////		while (number % i == 0)//先跑内循环while跑完再跑外循环
//////////////		{
//////////////			printf("质因数i=%d\n", i);
//////////////			number = number / i;//求商作为下一次number值
//////////////
//////////////			if (number != 1)//当number=1的时候number%i永远=1所以while永远不执行，for不满足，直接跳出换行
//////////////				printf("************\n");
//////////////		}
//////////////	}
//////////////	printf("\n");
////////////
/////////////*利用条件运算符的嵌套来完成此题：学习成绩>=90分的同学用A表示，60-89分之间的用B表示，60分以下的用C表示。*/
//////////////int chengji;
//////////////printf("请输入成绩\n");
//////////////scanf_s("%d",&chengji);
//////////////if (chengji >= 90)
//////////////printf("该同学的成绩为A\n");
//////////////else if (chengji >= 80 && chengji < 90)
//////////////	printf("该同学的成绩为B\n");
//////////////else if (chengji >= 70 && chengji < 80)
//////////////	printf("该同学的成绩为C\n");
//////////////else if (chengji>=0&&chengji < 70)
//////////////	printf("该同学的成绩为D\n");
//////////////else
//////////////	printf("输入错误请重新输入\n");
////////////
/////////////*输入两个正整数m和n，求其最大公约数和最小公倍数。*/
/////////////*最小公倍数：几个数共有的倍数叫做这几个数的公倍数,其中最小的一个叫做这几个数的最小公倍数.
////////////  最大公约数：指某几个整数共有因子中最大的一个
////////////(1)分解质因数法.先把这几个数分解质因数,再把它们一切公有的质因数和其中几个数公有的质因数
////////////以及每个数的独有的质因数全部连乘起来,所得的积就是它们的最小公倍数.例如,求[12,18,20],
////////////因为12=2^2×3,18=2×3^2,20=2^2×5,其中三个数的公有的质因数为2,两个数的公有质因数为2与3,
////////////每个数独有的质因数为5与3,所以,[12,18,20]=2^2×3^2×5=180.(可用短除法计算)*/
////////////int m, n;//两个正整数m,n
////////////int i, j;//设m质因数为i,n的质因数为j
////////////int t;
////////////int gongyou;//i,j共有质因数
////////////printf("请输入两个正整数m,n\n");
////////////scanf_s("%d,%d",&m,&n);
//////////////求m的质因数
////////////for (i = 2;i <= m; i++)
////////////{
////////////	while (m % i == 0)
////////////	{
////////////		printf("m的质因数为%d\n",i);
////////////		t = i;
////////////		m = m / i;
////////////		if (m != 1)
////////////		printf("*******************\n");
////////////	}
////////////}
////////////
////////////printf("\n");
////////////printf("**************************\n");
//////////////求n的质因数
////////////for (j = 2; j <= n; j++)
////////////{
////////////	while (n % j == 0)
////////////	{
////////////		printf("n的质因数为%d\n", j);
////////////		t = j;
////////////		n = n / j;
////////////		if (n != 1)
////////////			printf("*******************\n");
////////////	}
////////////}
////////////	printf("\n");
////////////
////////////int m, n, t, yu, ji;
////////////yu = 0;
////////////ji = 0;
////////////printf("请输入两个数\n");
////////////scanf_s("%d,%d",&m,&n);
////////////if (m < n)
////////////{
////////////	//从大到小排序
////////////	t = m;
////////////	m = n;
////////////	n = t;
////////////}
////////////	//运算
////////////	yu = m % n;
////////////	ji = m * n;
//////////// while(yu!=0)
////////////{
////////////	m = n;
////////////	n = yu;
////////////	yu = m % n;
////////////}
////////////printf("这两个数的最大公约数是%d\n最小公倍数是%d\n",n,ji/n);
////////////
////////////
////////////
//////////////输入一个整数判断其是否为水仙花数
//////////////int bai,shi,ge;
//////////////int number;
//////////////printf("请输入一个三位数\n");
//////////////scanf_s("%d",&number);
//////////////	bai = number / 100;//百位
//////////////	shi = number%100/10;//十位
//////////////	ge = number%10;//个位
//////////////	if (number == pow(bai,3) + pow(shi,3) + pow(ge,3))//调用数学函数计算次方
//////////////		printf("该数为水仙花数\n");
//////////////	else
//////////////		printf("该数不为水仙花数\n");
////////////
////////////
/////////////*输入一行字符，分别统计出其中英文字母、空格、数字和其它字符的个数。*/
//////////////char zifu;
//////////////printf("请输入一行字符\n");
//////////////scanf_s("%c",zifu);
//////////////
//////////////
//////////////	return 0;
//////////////}
//////
////////#include <stdio.h>
////////int main(void)
////////
////////{
////////	int ge, shi, bai;
////////	for (ge = 1; ge < 5; ge++)
////////	{
////////		for (shi = 1; shi < 5; shi++)
////////		{
////////			for (bai = 1; bai < 5; bai++)
////////			{
////////				if (ge != shi && shi != bai && ge != bai)
////////					printf("%d,%d,%d\n", ge, shi, bai);
////////			}
////////		}
////////	}
////////
////////	return 0;
////////}
//////
////////#include <stdio.h>
////////int main(void)
////////{
////////	double  jiangjin10, jiangjin20, jiangjin40, jiangjin60, jiangjin100, jiangjin,lirun;
////////	printf("请输入利润\n");
////////	scanf_s("%lf",&lirun);
////////	//基础部分
////////	jiangjin10 = 100000 * 0.1;
////////	jiangjin20 = jiangjin10 + 100000 * 0.75;
////////	jiangjin40 = jiangjin20 + 100000 * 0.05;
////////	jiangjin60 = jiangjin40 + 100000 * 0.03;
////////	jiangjin100 = jiangjin60 + 100000 * 0.015;
////////	if (lirun <= 100000)
////////		jiangjin = lirun*0.1;
////////	else if (lirun <= 200000)
////////		jiangjin = jiangjin10 + (lirun - 100000) * 0.75;
////////	else if (lirun <= 400000)
////////		jiangjin = jiangjin20 + (lirun - 200000) * 0.05;
////////	else if (lirun <= 600000)
////////		jiangjin = jiangjin40 + (lirun - 400000) * 0.03;
////////	else if (lirun <= 1000000)
////////		jiangjin = jiangjin60 + (lirun - 600000) * 0.015;
////////	else if (lirun > 1000000)
////////	{
////////		jiangjin = jiangjin100 + (lirun - 1000000) * 0.01;
////////	}
////////		printf("应发放总奖金为%lf\n", jiangjin);
////////	return 0;
////////}
///////*一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？*/
////////∴n+100=a2①，n+168=b2②，∴②-①得：b2-a2=68，∴（b+a）（b-a）=68，∵a与b都是正整数，
////////∴b+a与b-a同奇或同偶，∴b...
////////首先设这个数是n，则n+100=a2，n+168=b2，两式作差，则（b+a）（b-a）=68，所以b+a=34，b-a=2，整数62有2*34，68*1继而求得答案．
////////#include <stdio.h>
////////#include <math.h>
////////int main(void)
////////{
////////	int m, n,i;
////////	for (i = 1; i < 100000; i++)//就是在这个范围内查找
////////	{
////////		m = sqrt(i+100);//求根号
////////		n = sqrt(i+268);
////////		if (m * m == i + 100 && n * n == i + 268)
////////		{
////////				printf("i=%d\n",i);		
////////		}
////////	}
////////	return 0;
////////}
////////#include <stdio.h>
////////int main(void)
////////{
////////	//输入一个年份月份和日期, 输出该天是当年的第几天
////////	//输入两个日期，计算两个日历的间隔时间
////////		int year, month, day;
////////		int sum;//月份以前的天数
////////		sum = 0;
////////		printf("请输入一个年份、月份和日期\n");
////////		scanf_s("%d,%d,%d", &year, &month,&day);
////////		switch (month)
////////		{
////////				case 12:sum += 31; 
////////				case 11:sum += 31;
////////				case 10:sum += 30;
////////				case 9:sum += 31;
////////				case 8:sum += 31;
////////				case 7:sum += 30;
////////				case 6:sum += 31;
////////				case 5:sum += 30;
////////				case 4:sum += 31;
////////				case 3:
////////					if ((year % 400 == 0) || ((year % 4 == 0) && (year % 100 != 0)))
////////						sum += 29;
////////					else
////////						sum += 28;			
////////				case 2:sum += 31;
////////				case 1:sum += day;break;
////////				default: printf("输入错误"); break;
////////		}
////////		printf("这一天是这一年的第%d天\n", sum);
////////		return 0;
////////}
//////
////////输入三个整数x,y,z，请把这三个数由小到大输出
////////#include <stdio.h>
////////int main (void)
////////{
////////	int x, y, z,t;
////////	printf("请输入三个数x,y,z\n");
////////	scanf_s("%d,%d,%d",&x,&y,&z);
////////	if (x > y)
////////	{
////////		t = x;
////////		x = y;
////////		y = t;
////////	}
////////	if (x > z)
////////	{
////////		t = x;
////////		x = z;
////////		z = t;
////////	}
////////	if (y > z)
////////	{
////////		t = y;
////////		y = z;
////////		z = t;
////////	}
////////	printf("x,y,z从小到大依次为%d,%d,%d\n",x,y,z);
////////	return 0;
////////}
//////
////////输出9 * 9口诀
////////#include <stdio.h>
////////int main(void)
////////{
////////	int i,j,chengji;
////////	printf("\n");
////////	for (i = 1; i <= 9; i++)
////////	{
////////		for (j = 1; j <= i; j++)
////////		{
////////			chengji = i * j;
////////			printf("%d*%d=%-3d",i,j,chengji);//左对齐三位
////////		}
////////		printf("\n");
////////	}
////////
////////	return 0;
////////}
//////
////////输入一个正整数，将其转换为二进制  短除法
////////n/2商作为下一次的输入继续/2,余数打印
////////#include <stdio.h>
////////int main(void)
////////{
////////	int n,i,j,shang,yushu;
////////	int number[100];
////////	printf("请输入一个正整数\n");
////////	scanf_s("%d", &n);
////////	
////////		for (i = 1; i <= n * i; i++)//循环i能除多少次n/i商几就除几次所以这里n要*i
////////		{
////////			yushu= n % 2;
////////			printf("%d", yushu);
////////			n = n / 2;		
////////		}
////////	return 0;
////////}
////////一球从100米高度自由落下，每次落地后反跳回原高度的一半；
////////再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
////////#include <stdio.h>
////////int main(void)
////////{
////////	float juli,gao;
////////    int i;
////////	gao = 100;
////////	juli = 100;
////////    gao = gao / 2;//第一的反弹高度作为第二次的初始高度
////////	for (i = 2; i <= 10; i++)
////////	{
////////		juli = juli + 2*gao;//距离
////////		gao = gao / 2;
////////	}	
////////   
////////	printf("一共经过%f米\n第十次反弹%f米\n",juli,gao);
////////		return 0;
////////}
///////*古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，
//////小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？*/
////////#include <stdio.h>
////////int rabbit(int n);
////////int rabbit(int n)
////////{
////////	if (n == 1 || n == 2)
////////	{
////////		return 1;
////////	}
////////	else
////////	{
////////		return rabbit(n - 1) + rabbit(n - 2);
////////	}
////////}
////////int main()
////////{
////////	int n;
////////	printf("请输入一个月份\n");
////////	scanf_s("%d",&n);
////////	printf("第%d个月兔子共有%d只",n,rabbit(n));
////////	return 0;
////////}
//////
////////
//////////判断101 - 200之间有多少个素数，并输出所有素数，每5个数据一行。
//////////素数：只能被1和它自己整除
////////判断素数的方法：用一个数分别去除 2 到 sqrt(这个数)求根号，
////////如果能被整除，则表明此数不是素数，反之是素数。
////////#include <stdio.h>
////////#include <math.h>
////////int main()
////////{
////////	int i, j, n = 0;
////////	for (i = 101; i <= 200; i = i + 2)
////////	{
////////		for (j = 2; j <= sqrt(i); j++)
////////		{
////////			if (i % j == 0)
////////			break;
////////		}
////////		if (j>sqrt(i))
////////		{
////////			n++;
////////			printf("%d,",i);
////////			if (n % 5 == 0) 
////////			printf("\n");
////////		}
////////	}
////////	return 0;
////////}
////////键盘输入的字符中统计数字字符的个数
////////#include <stdio.h>
////////    int main()
////////    {
////////        int cnt = 0, c;
////////        while ((c = getchar()) != '\n')
////////            if (c >= '0' && c <= '9')
////////                cnt++;
////////        printf("数字字符个数=%d\n", cnt);
////////    }
//////
////////#include <stdio.h>
////////int fun(unsigned int x);
////////int fun(unsigned int x)
////////{
////////    int n = 0;
////////    while ((x + 1))
////////    {
////////        n++;
////////        x = x | (x + 1);
////////        printf("%d\n",x);
////////    }
////////    return n;
////////}
//////
////////main()
////////{
////////    int x;
////////    x = fun(2014);
////////    printf("%d",x);
//////   /* int i = 1;
//////    int s = 3;
//////    do
//////    {
//////        s += i++;
//////        if (s % 7 == 0)
//////            continue;
//////        else
//////            ++i;
//////    } while (s < 15);
//////    printf("%d", i);*/
//////    /*char* s = "\ta\018bc";
//////        for (; *s !='\0'; s++)
//////            printf("*");*/
//////
//////
////////    return 0;
////////}
////////
///////*打印出所有的“水仙花数”，所谓“水仙花数”是指一个三位数，
//////其各位数字立方和等于该数本身。例如：153是一个“水仙花数”，
//////因为153=1的三次方＋5的三次方＋3的三次方。100~999
//////*/
////////#include <stdio.h>
////////#include <math.h>
////////int main(void)
////////{
////////    int ge, shi, bai,i;
////////    for (i = 100; i < 1000; i++)
////////    {
////////        bai = i / 100;
////////        shi = (i-100*bai) / 10;
////////        ge = i-100*bai-10*shi;
////////        if (i == pow(bai,3)+pow(shi,3)+pow(ge,3))
////////        printf("水仙花数=%d\n",i);
////////     }
////////    return 0;
////////}
//////
//////
///////*将一个正整数分解质因数。例如：输入90,打印出90=2*3*3*5*/
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number;//表示输入正整数
////////    int i;//设质数为i
////////    printf("请输入一个数\n");
////////    scanf_s("%d", &number);
////////
////////    for (i = 2; i <= number; i++)//i从2开始一直到number
////////    {
////////        while (number % i == 0)//先跑内循环while跑完再跑外循环
////////        {
////////            printf("质因数i=%d\n", i);
////////            number = number / i;//求商作为下一次number值
////////
////////            if (number != 1)//当number=1的时候number%i永远=1所以while永远不执行，for不满足，直接跳出换行
////////                printf("************\n");
////////        }
////////    }
////////    printf("\n");
////////    return 0;
////////}
//////
//////
////////将一个数因数分解
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number;
////////    int i;
////////    printf("请输入一个正整数\n");
////////    scanf_s("%d",&number);
////////    for (i = 2; i <= number; i++)任何一个数都能分解成1和它本身所以除去1
////////    {
////////        while(number % i == 0)
////////        {
////////            printf("质数i=%d\n",i);
////////            number = number / i;
////////            if (number != 1)//当number=1的时候number%i永远=1所以while永远不执行，for不满足，直接跳出换行
////////            printf("********************************\n");
////////        }
////////    }
////////    printf("\n");
////////    return 0;
////////}
//////
////////利用条件运算符的嵌套来完成此题：学习成绩 >= 90分的同学用A表示
////////60 - 89分之间的用B表示，60分以下的用C表示。
////////#include <stdio.h>
////////int main(void)
////////{
////////    int chengji;
////////    printf("请输入成绩\n");
////////    scanf_s("%d",&chengji);
////////    if (chengji >= 90)
////////        printf("该同学的成绩为A\n");
////////    else if(chengji>=60&&chengji<=89)
////////        printf("该同学的成绩为B\n");
////////    else if(chengji<60)
////////        printf("该同学的成绩为C\n");
////////    return 0;
////////}
///////*输入一行字符，分别统计出其中英文字母、空格、数字和其它字符的个数*/
////////#include <stdio.h>
////////int main(void)
////////{
////////    int yingwen, kongge, shuzi, other;
////////    char zifu;
////////    yingwen = 0;
////////    kongge = 0;
////////    shuzi = 0;
////////    other = 0;
////////    printf("请输入一行字符\n");
////////    while ((zifu = getchar()) != '\n')
////////    {
////////        if (zifu >= 'a' && zifu <= 'z' || zifu >= 'A' && zifu <= 'Z')
////////            yingwen++;
////////        if (zifu == ' ')
////////            kongge++;
////////        if (zifu >= '0' && zifu <= '9')
////////            shuzi++;
////////        else
////////            other++;
////////    }
////////    printf("英文字母有%d个\n空格有%d个\n数字有%d个\n其他字符有%d个\n",yingwen,kongge,shuzi,other);
////////    return 0;
////////}
//////
///////*求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。
//////例如2+22+222+2222+22222(此时共有5个数相加)，几个数相加有键盘控制*/
////////#include <stdio.h>
////////int main(void)
////////{
////////    int a,n,sum,i,zhi;
////////    sum = 0;
////////    zhi = 0;
////////    printf("请输入初始数值\n");
////////    scanf_s("%d",&a);
////////    printf("确定相加的个数\n");
////////    scanf_s("%d",&n);
////////    for (i = 1; i <= n; i++)
////////    {
////////        zhi = 10 * zhi + a; //第一个数肯定是a,后一个数=前面一个数a*10+a
////////        sum = sum + zhi;
////////    }
////////        printf("sum=%d\n", sum);
////////        return 0;
////////}
//////
////////输入一个字符，如果是大写字母则，将其以小写形式输出，如果是小写字母，
////////则将其以大写形式输出。如果不是英文字母，则原样输出。
////////#include <stdio.h>
////////int main(void)
////////{
////////    char a;
////////    printf("请输入一个字符\n");
////////    scanf_s("%c",&a);
////////    if (a >= 'A' && a <= 'Z')
////////        printf("%c",(a+32));
////////    else if (a >= 'a' && a <= 'z')
////////        printf("%c",(a-32));
////////    else
////////        printf("%c",a);
////////}
////////求T=1!+2!+3!+…+10!的值
//////////#include <stdio.h>
//////////int di_gui(int n);
//////////int di_gui_he(int n);
//////////
//////////int di_gui_he(int n)
//////////{
//////////    int sum;
//////////    if (n == 1)
//////////        sum = 1;
//////////    else if (n == 0)
//////////        sum = 0;
//////////    else 
//////////        sum = di_gui_he(n - 1) + di_gui(n);
//////////    return sum;
//////////}
//////////int di_gui(int n)
//////////{
//////////    int result;
//////////    if (n == 1||n==0)
//////////        result =  1;
//////////    else
//////////        result= di_gui(n - 1)*n;
//////////    return result;
//////////}
//////////int main(void)
//////////{
//////////    int sum,n;
//////////    sum = 0;
//////////    scanf_s("%d",&n);
//////////    sum = di_gui_he(n);
//////////    printf("sum=%d", sum);
//////////    return  0;
//////////}
//////// 
//////////求T=1!+2!+3!+…+10!的值
////////
////////#include <stdio.h>
////////int main(void)
////////{ 
////////    int i,jiecheng,sum;
////////    sum = 0;//初始值为1的阶乘
////////    jiecheng = 1;//第1项的阶乘
////////    for (i = 1; i <=4; i++)
////////    {
////////        jiecheng = i*jiecheng;//第2项的阶乘*第1项的阶乘//第n项的值为第n-1项的n倍。
////////        sum = sum + jiecheng;
////////    }
////////    printf("sum=%d", sum);
////////    return 0;
////////}
//////
////////一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，
////////求它在第10次落地时，共经过多少米？第10次反弹多高？
////////#include <stdio.h>
////////int main(void)
////////{
////////    int i;
////////    float gao, juli;
////////    gao = 100;//高度
////////    juli = 0;//经过距离
////////    gao = gao / 2;//第一次反弹的高度是第二次的初始高度
////////    for (i = 2; i <=10; i++)
////////    {
////////        juli = juli + gao * 2;
////////        gao = gao / 2;
////////    }
////////    printf("共经过%f米\n第十次反弹%f米\n",juli,gao);
////////    return 0;
////////}
/////////*猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，
////////又多吃了一个第二天早上又将剩下的桃子吃掉一半，又多吃了一个。
////////以后。到第10天早上想再吃时，
////////见只剩下一个桃子了。求第一天共摘了多少。*/
////////#include <stdio.h>
//////////每天都吃了前一天剩下的一半零一个
////////int main(void)
////////{
////////    int x1;//设前一天的桃子数
////////    int x2;//设第二天的桃子数
////////    int day = 9;
////////    x2= 1;//第十天剩下的桃子
////////    while (day > 0)
////////    {
////////        x1 = (x2 + 1) * 2;
////////        x2 = x1;
////////        day--;
////////    }
////////    printf("桃子的总数=%d个\n", x1);
////////    return 0;
////////}
//////
//////
//////
////////猴子吃桃__递归
////////函数功能：  求桃子总数
////////参数：      天数
////////返回值桃子数量
////////#include <stdio.h>
////////int taozi(int day);
////////int taozi(int day)
////////{
////////    int sum;
////////    sum = 1;
////////    if (day < 10)
////////    {
////////        sum =sum+taozi(day + 1) * 2+1;
////////        return sum;
////////    }
////////    else
////////        return  sum;
////////}
////////
////////int main(void)
////////{
////////   printf("桃子总数=%d",taozi(1));
////////    return 0;
////////}
/////////*两个乒乓球队进行比赛，各出三人。甲队为a,b,c三人，
////////乙队为x,y,z三人。已抽签决定比赛名单。有人向队员打听比赛的名单。
////////a说他不和x比，c说他不和x,z比，请编程序找出三队赛手的名单。*/
////////#include <stdio.h>
////////int main(void)
////////{
////////
////////    return 0;
////////}
//////
///////*打印出如下图案（菱形）*/
////////#include <stdio.h>
////////int main(void)
////////{
//////// 
////////        printf("   *\n");
////////        printf("  ***\n");
////////        printf(" *****\n");
////////        printf("*******\n");
////////        printf(" *****\n");
////////        printf("  ***\n");
////////        printf("   *\n");
////////    return 0;
////////}
//////////
//////////#include <stdio.h>
//////////int di_gui_jiecheng(int n);
//////////int di_gui_he(int n);
//////////
//////////int di_gui_jiecheng(int n)
//////////{
//////////    int relust;
//////////    if (n == 1 || n == 0)
//////////        relust = 1;
//////////    else
//////////        relust = di_gui_jiecheng(n - 1) * n;
//////////    return relust;
//////////}
//////////
//////////int di_gui_he(int n)
//////////{
//////////    int sum;
//////////    if (n == 1)
//////////        sum = 1;
//////////    else if (n == 0)
//////////        sum = 0;
//////////    else
//////////        sum = di_gui_he(n-1)+di_gui_jiecheng(n);
//////////    return sum;
//////////}
//////////int main(void)
//////////{
//////////    int sum, n;
//////////    printf("请输入一个数\n");
//////////    scanf_s("%d",&n);
//////////    sum = di_gui_he(n);
//////////    printf("该数的阶乘=%d\n", sum);
//////////    return 0;
//////////}
//////
//////
////// 
////////# include <stdio.h>
////////int main(void)
////////{
////////    char str[40];
////////    char string_1;
////////    //一定要先将指针变量初始化
////////    char* string;
////////    string = &string_1;
////////    printf("请输入字符串：");
////////    gets(string);  //也可以写成gets(string);
////////    printf("%s\n", string);
////////    system("pause");
////////    return 0;
////////}
//////
//////
//////
////////输入一个正整数，将其转换为二进制  短除法
////////n/2商作为下一次的输入继续/2,余数打印
////////#include <stdio.h>
////////int main(void)
////////{
////////	int n,i,j,shang,yushu;
////////	int sum=0;
////////    i = 1;
////////    yushu = 0;
////////	printf("请输入一个正整数\n");
////////	scanf_s("%d", &n);
////////	
////////		while(n!=0)
////////		{
////////            yushu= yushu+n%2*i;
////////            i = i * 10;
////////			n = n / 2;		
////////		}
////////        printf("%d",yushu);
////////	return 0;
////////}
//////
////////////递归调用十进制转二进制
//////////#include <stdio.h>
//////////int di_gui(int n);
//////////
//////////int di_gui(int n)
//////////{
//////////    int yushu;
//////////    yushu = n % 2;//取余数
//////////    if (n >= 2)//判断输入数值是否大于等于2，若满足则对商执行第二次递归调用
//////////        di_gui(n / 2);//递归调用
//////////    putchar(yushu == 0 ? '0' : '1');//余数打印，这里利用递归函数特性，
//////////                     //求余数是传递的过程，打印是归的过程，所以打印刚好是反过来的
//////////}
//////////int main(void)
//////////{
//////////    int n;
//////////    printf("请输入一个数\n");
//////////    while (scanf_s("%d", &n) == 1)//如果输入值为1则真调用递归函数
//////////        di_gui(n);
//////////    return 0;
//////////}
////////
//////// 
//////// 
//////// 
////////求以下数列前15项的和：2/1,3/2,5/3,8/5,13/8,21/13....
////////规律分子=分子+分母，分母 = 前一次的分子
////////#include <stdio.h>
////////int main(void)
////////{
////////    float fz;
////////    float fu;
////////    float sum;
////////    float a;
////////    a = 0;
////////    sum = 0;
////////    fz = 2;
////////    fu = 1;
////////    int i;
////////    for (i = 1; i <= 15; i++)
////////    {
////////        sum+= fz / fu;
////////        a = fz;
////////        fz = fz + fu;
////////        fu = a;
////////    }
////////    printf("十五次的和为%f\n",sum);
////////    return 0;
////////}
//////
////////求两个正整数的最大公约数和最小公倍数。
////////最大公约数：能分别被这两个数整除的数值中的最大值
////////最小公倍数：能分别整除这两个数的数值中的最小值
//////
////////分析两个数的最大公约数
////////肯定从较小的那个数开始来循环查找，而且还要倒着查找不能从1开始，
//////// 例如7和21的最大公约数肯定从7开始
////////要找最大的，倒着找第一个就是最大的
//////#include <stdio.h>
//////int main(void)
//////{
//////    int a, b;
//////    printf("请输入两个数\n");
//////    scanf_s("%d,%d",&a,&b);
//////    int i = a < b ? a : b;
//////
//////    while (i>=1)//从二者较小的递减查找开始找，
//////    {
//////        if (a % i == 0 && b % i == 0)
//////        {
//////            printf("最大公约数=%d",i);
//////            break;
//////        }
//////        i--;
//////    }
//////    //分析两个数的最小公倍数
//////  //肯定从较大的那个数开始来循环查找，并且从1开始，
//////  // 例如7和21的最大公约数肯定从21开始
//////  //要找最小的，从1开始第一个满足的就是最小的
//////    i = a < b ? b : a;//从二者最大的那个开始查找
//////    while (i <= a*b)//从二者较大的开始递加查找
//////    {
//////        if (i % a == 0 && i % b == 0)
//////        {
//////            printf("最小公倍数=%d",i);
//////            break;
//////        }
//////
//////    }
//////    i++;
//////}
////////
////////循环题目一定要确定循环条件和循环体
////////循环条件
////////循环体
////////#include <stdio.h>
////////int main (void)
////////{
////////    int n;
////////    printf("请输入一个数");
////////    scanf_s("%d",&n);
////////    int yushu = 0;
////////    int  i = 1;
////////    //循环体 对输入的数取余数求和，再/2商作为下一次的被除数
////////    //循环条件  以被除数为0结束
////////    while (n!=0)
////////    {
////////        yushu = yushu+n % 2 * i;
////////        i = i * 10;
////////        n = n / 2;
////////    }
////////    printf("该数的二进制=%d",yushu);
////////    return 0;
////////}
//////
////////遍历即穷举法
////////循环体a,b,c
////////循环条件a=0~9,b=0~9,c=0~9
////////已知a，b，c都是1位整数，求当三位整数abc，cba的和为1333时a,b,c的值。
//////////#include <stdio.h>
//////////int main(void)
//////////{
//////////    int a, b, c;
//////////    for (a = 1; a <= 9; a++)//这里a不能为0因为是三位数
//////////    {
//////////        for (b = 0; b <= 9; b++)
//////////        {
//////////            for (c = 1; c <= 9; c++)//这里c不能为0因为是三位数
//////////            {
//////////                if ((a * 100 + b * 10 + c) + (c * 100 + b * 10 + a) == 1333)
//////////                    printf("a=%d,b=%d,c=%d\n", a, b, c);
//////////            }
//////////        }
//////////
//////////    }
//////////    return 0;
//////////}
////////递归函数求十进制转二进制
////////#include <stdio.h>
////////int di_gui(int n);
////////int di_gui(int n)
////////{
////////    int yushu ;
////////    yushu = n % 2;
////////    if (n>= 2)
////////        di_gui(n /2 );//递归调用
////////    putchar(yushu == 0 ? '0' : '1');
////////
////////}
////////int main(void)
////////{
////////    int n;
////////    printf("请输入一个数\n");
////////    while (scanf_s("%d", &n) == 1)
////////        di_gui(n);
////////    return 0;
////////}
////////求100以内所有质数
////////质数除去1和它本身不能被任何数整除
////////循环条件 当判断的值超过100时结束循环
////////循环体    判断当前值是否为质数若是质数则打印
////////循环条件  除数从2到当前值-1  (除去1、和它本身)
////////循环体  当前值除余循环变量判断是否能够整除
////////#include <stdio.h>
////////int main(void)
////////{
////////    printf("2是质数\n");
////////    printf("3是质数\n");
////////    int i; 
////////    i = 4;//遍历数据
////////    while (i <= 100)
////////    {
////////        int n = 2;//除数
////////        while (n <= i - 1)//如果n>i-1即
////////        {
////////            if (i % n == 0)
////////            {
////////                break;
////////            }
////////            n++;
////////        }
////////      
////////        if (n == i)
////////        {
////////            printf("%d是质数\n", i);
////////        }
////////        i++;
////////    }
////////    return 0;
////////}
////////
//////
////////有一分数序列：2/1，3/2，5/3，8/5，13/8，21/13...求出这个数列的前20项之和
////////分子=分子+分母
////////分母：后一项的分母等于前一项的分子
////////#include <stdio.h>
////////int main(void)
////////{
////////    float fz, fu, i,zhong_jian_zhi,sum;
////////    fz = 2;
////////    fu = 1;
////////    sum = 0;
////////    zhong_jian_zhi=0;
////////    for (i = 1; i <= 20; i++)
////////    {
////////        sum = sum + fz / fu;
////////        zhong_jian_zhi = fz;
////////        fz = fz + fu;
////////        fu = zhong_jian_zhi;
////////    }
////////    printf("结果=%f\n", sum);   
////////    return 0;
////////}
//////
////////求1+2!+3!+...+20!的和
//////////#include <stdio.h>
//////////int jiecheng(int n);
//////////int jiecheng_he(int n);
//////////
//////////int jiecheng(int n)
//////////{
//////////    int result;
//////////    if (n == 1 || n == 0)
//////////        result = 1;
//////////    else
//////////    result = jiecheng(n-1)*n;
//////////    return result; 
//////////}
//////////int jiecheng_he(int n)
//////////{
//////////    int sum;
//////////    if (n == 1)
//////////        sum = 1;
//////////    else if (n == 0)
//////////        sum = 0;
//////////    else
//////////        sum = jiecheng_he(n - 1) + jiecheng(n);
//////////    return  sum;
//////////}
//////////
//////////int main(void)
//////////{
//////////    int n,sum;
//////////    printf("请输入一个数\n");
//////////    scanf_s("%d",&n);
//////////    sum =jiecheng_he(n);
//////////    printf("阶乘和=%d", sum);
//////////    return 0;
//////////}
//////
//////
///////*利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。*/
////////#include <stdio.h>
////////void di_gui(int n);
////////
////////void di_gui(int n)
////////{
////////    char next;
////////                //递归调用必须要有判断语句且参数是对形参判断
////////    if (n <=1 )//如果字符数小于=1则代表输入完成就打印
////////    {
////////        next = getchar();
////////        printf("相反顺序输出结果\40:\40");//\40表示空格
////////        putchar(next);//打印第5次字符
////////    }
////////    else
////////    {
////////        next = getchar();//首先先写入字符数据
////////        di_gui(n - 1);//递归调用,这里调用还没完成就不会执行下面的打印
////////        putchar(next);//打印前4次字符
////////    }
////////}
////////int main (void)
////////{
////////    int zifu = 5;
////////    printf("请输入5个字符：\n");  
////////    //rewind(stdin);//清空缓冲区
////////    di_gui(zifu);
////////    return 0;
////////}
//////
////////字符输入输出用getchar,putchar,比较简便
//////
////////判断函数是不是三角形
////////#include <stdio.h>
////////int sanjiao(int a, int b ,int c);
////////int sanjiao(int a, int b , int c)
////////{
////////        if (((a + b > c) && (a+c>b)&&(b+c>a))&&((a - b < c)&& (a-c<b) && (b - c < a)))
////////            return 1;
////////        else 
////////            return 0;
////////}
////////
////////int main(void)
////////{
////////    int a, b, c;
////////    printf("请输入三个数\n");
////////    scanf_s(" %d,%d,%d",&a,&b,&c);
////////    if (sanjiao(a, b, c) == 1)
////////        printf("能组成三角形\n");
////////    else
////////        printf("不能组成三角形");
////////    return 0;
////////}
////////分析
////////首先函数功能是什么
////////主函数需要干什么
////////返回值 需不需要
////////参数 是什么  
//////
//////
////////输入待计算的式子
////////调用相关函数得到计算后的值并打印
////////#include <stdio.h>
////////
////////float jiafa(float a, float b);
////////float jianfa(float a, float b);
////////float chengfa(float a, float b);
////////float chufa(float a, float b);
////////
////////float jiafa(float a, float b)
////////{
////////    return a+b;
////////}
////////float jianfa(float a, float b)
////////{
////////    return a - b;
////////}
////////float chengfa(float a, float b)
////////{
////////    return a*b;
////////}
////////float chufa(float a, float b)
////////{
////////    return a/b;
////////}
////////
////////int main(void)
////////{
////////    while (1)
////////    {
////////        float a, b;
////////        char c;
////////        printf("******计算器******\n");
////////        printf("请输入待计算的式子\n");
////////        scanf_s("%f", &a);
////////        rewind(stdin);
////////        /*   a = getchar();*/
////////        c = getchar();
////////        //b = getchar();
////////        scanf_s("%f", &b);
////////        //printf("%d %c %d", a-48, c, b-48);
////////        //rewind(stdin);
////////
////////        switch (c)
////////        {
////////        case '+': printf("结果为%f\n", jiafa(a, b));
////////            break;
////////        case '-': printf("结果为%f\n", jianfa(a, b));
////////            break;
////////        case '*': printf("结果为%f\n", chengfa(a, b));
////////            break;
////////        case '/': printf("结果为%f\n", chufa(a, b));
////////            break;
////////        }
////////    }
////////    return 0;
////////}
//////
////////设计一个函数计算1到n之间有多少个质数
////////函数功能计算1到n之间有多少个质数
//////
////////#include <stdio.h>
////////int zhishu(int n);
////////int geshu(int n);
//////////统计质数的个数
////////int geshu(int n)
////////{
////////    int sum;
////////    sum = 0;
////////    int i;
////////    //统计i到n之间的质数个数
////////    for (i = 2; i <= n; i++)
////////    {
////////        if (zhishu(i) == 1)
////////        {
////////            printf("%d是质数\n", i);
////////            sum++;
////////        }
////////    }
////////    //printf("1到%d直间的质数为%d\n", n,sum);
////////    return sum;
////////}
//////////判断该数是否为质数
//////////质数打印1；  质数打印0；
////////int zhishu(int n)
////////{
////////    int i;
////////    for(i=2;i<n;i++)
////////    {
////////        if (n % i == 0)
////////            return 0;
////////    }
////////    return 1;
////////}
////////int main(void)
////////{
////////    int n,sum;
////////    printf("请输入一个数\n");
////////    scanf_s("%d", &n);
////////    sum = geshu(n);
////////    printf("1到%d直间的质数个数为%d个", n,sum);
////////    return 0;
////////}
////////设计一个函数计算得知一个正整数的位数
////////分析
////////首先函数功能是什么
////////主函数需要干什么
////////返回值 需不需要
////////参数 是什么  
//////////#include <stdio.h>
//////////int weishu(int n);
//////////int weishu(int n)
//////////{
//////////    int sum=0;//统计有多少位
//////////  while(n>=1)
//////////    {
//////////        sum++;
//////////        n =n/10;//计算位数
//////////    } 
//////////        return sum;
//////////}
//////////int main(void)
//////////{
//////////    int n,sum;
//////////    sum = 0;
//////////    printf("请输入一个正整数\n");
//////////    scanf_s("%d",&n);
//////////    sum = weishu(n);
//////////    printf("该数共有%d位\n", sum);
//////////    return 0;
//////////}
//////
//////
////////分析
////////首先函数功能是什么:从1到n之间一共输出了多少次1
////////主函数需要干什么  输入一个数,打印1到n之间共有多少1
////////返回值 需不需要
////////参数 是什么           传入参数n
////////设计一个函数输出1到n之间输出了多少次1
////////#include <stdio.h>
////////////解析：将1看成余数来求解
////////int num_init(int n);
//////////算某个数有多少个1
////////int num_init(int n)
////////{
////////    int sum = 0;//统计输出1的次数  计数
////////    while(n)
////////    {
////////        if (n % 10 == 1)
////////        sum+=1;
////////        n = n/10;//除10降位
////////    }
////////    return sum;
////////}
////////int main(void)
////////{
////////    int n,i, sum;
////////    sum = 0;
////////    printf("请输入一个正整数\n");
////////    scanf_s("%d",&n);
////////    for (i = 1; i <= n; i++)
////////    {
////////        sum = sum+num_init(i);//将每一次的统计数据累加
////////    }
////////    printf("1到%d共输出了%d次1\n",n, sum);
////////    return 0;
////////}
//////// 
//////// 
//////// 有5个人坐在一起，问第五个人多少岁？他说比第4个人大2岁。问第4个人岁数，
//////// 他说比第3个人大2岁。问第三个人，又说比第2人大两岁。问第2个人，
//////// 说比第一个人大两岁。最后问第一个人，他说是10岁。请问第五个人多大？
////////#include <stdio.h>
////////////分析  5个数，后一个比前一个大2  n2 = di_gui(n-1)+2
////////int di_gui(int n);
////////int di_gui(int n)
////////{
////////    int n1;//表示第一个人的岁数
////////    if (n == 1)
////////        n1 = 10;
////////    else 
////////    {
////////        n1 = di_gui(n - 1) + 2 ;//后一个人的年龄
////////    }
////////    return n1;
////////}
////////int main(void)
////////{
////////    int n2;//表示后一个人的年龄
////////    //普通算法
////////    //n1 = 10;//第一个人的岁数
////////    //for (i = 1; i <= 4; i++)
////////    //{
////////    //    n2 = n1 + 2*i;//后一个人的岁数
////////    //}
////////    n2 =  di_gui(5);//这里递归次数应该是5
////////    printf("第五个人的岁数=%d岁\n", n2);
////////    return 0;
////////}
////////递归算法十进制转二进制
//////////void di_gui(int n);
//////////void di_gui(int n)
//////////{
//////////    if (n>1)
//////////    {
//////////      di_gui(n / 2);
//////////      printf("%d",n%2);
//////////    }
//////////    else if(n==1)
//////////    {
//////////        printf("%d",1);
//////////    }
//////////}
//////////#include <stdio.h>
//////////int main(void)
//////////{
//////////    int n;
//////////    printf("请输入一个数\n");
//////////    scanf_s("%d", &n);
//////////    di_gui(n);
//////////    return 0; 
//////////}
//////////
//////
////////给一个不多于5位的正整数，要求：一、求它是几位数，二、逆序打印出各位数字。
////////#include <stdio.h>
//////////判断他是几位数
////////void  weishu(int n);
////////void  weishu(int n)
////////{
////////   
////////}
////////int main(void)
////////{
////////    int n;
////////    int m = 0;
////////    int number=0;
////////    char  x[7] = { NULL };
////////    scanf_s("%6s",x,7);
////////    printf("%s\n",x);
////////    printf("请输入一个数\n");
////////    scanf_s("%d",&n);
////////    printf("逆序输出为\n");
////////    //求几位数
////////    while (n >= 1)
////////    {
////////        number++;
////////        m = n % 10;//求各个位的数字
////////        printf("%d", m);
////////        n = n / 10;
////////    }
////////    printf("\n");
////////    printf("该数为%d位数\n", number);
////////   // weishu(n);
////////    return 0;
////////}
//////
//////
//////
//////#include <stdio.h>
//////gongyu(int num1, int num2);
//////gongyu(int num1, int num2)
//////{
//////    int temp, a, b;
//////    if (num1<num2)  //最大公约数找最小值
//////    {
//////        temp = num1;
//////        num1 = num2; 
//////        num2 = temp;
//////    }
//////    a = num1;
//////    b = num2;
//////    while (a>=1)
//////    {
//////        temp = a % b; 
//////        a = b; 
//////        b = temp;
//////    }
//////    return(b);
//////}
//////
//////int main(void)
//////{
//////    int max,num1,num2;
//////    scanf_s("%d,%d", &num1, &num2);
//////    max = gongyu(num1, num2);
//////    printf("%d",max);
//////    return 0;
//////}
//////
////////设计一个函数，能统计出m--n年之间一共有多少个闰年。
////////#include <stdio.h>
////////int runnian(int m,int n)
////////{ 
////////    int i,j,count;
////////    count = 0;
////////    i=  m > n ? m : n;
////////    j = m < n ? m : n; 
////////    for (j; j <= i; j++)
////////    {
////////        if ((j % 400==0) || ((j % 4) == 0) && (j % 100 != 0))
////////        {
////////            count++;
////////        }
////////    }
////////    return count;
////////}
////////int main(void)
////////{
////////    int m, n;
////////    printf("请输入两个年份\n");
////////    scanf_s("%d,%d", &m, &n);
////////    printf("%d", runnian(m,n));
////////    return 0;
////////}
//////// 
//////// 
//////// 
////////输入两个年份，求出这两个年份之间一共有多少天。要求编写函数解决问题
//////////#include <stdio.h>
//////////int year(int m, int n);
//////////int year(int m,int n)
//////////{ 
//////////    int i,j,count;
//////////    count = 0;
//////////    i=  m > n ? m : n;
//////////    j = m < n ? m : n; 
//////////    for (j; j <= i; j++)
//////////    {
//////////        if ((j % 400==0) || ((j % 4) == 0) && (j % 100 != 0))
//////////        {
//////////            count++;
//////////        }
//////////    }
//////////    return count;
//////////}
//////////int main(void)
//////////{
//////////    int m, n,max,min,number;
//////////    printf("请输入两个年份\n");
//////////    scanf_s("%d,%d", &m, &n);
//////////    max = m > n ? m : n;
//////////    min= m < n ? m : n;
//////////    number = (max - min) * 365 + year(m, n);
//////////    printf("%d",number);
//////////    return 0;
//////////}
//////// 
//////// 
//////// 设计一个函数将整数颠倒输出。比如：输入1234，输出4321
////////#include <stdio.h>
////////void fun(int n);
////////void fun(int n)
////////{
////////    int yushu;
////////    while (n >= 1)
////////    {
////////        yushu= n % 10;//先取余数求个位
////////        printf("%d",yushu);
////////        n = n / 10;//再降阶
////////    }
////////}
////////int main(void)
////////{
////////    int n;
////////    printf("请输入一个数\n");
////////    scanf_s("%d", &n);
////////    fun(n);
////////    return 0;
////////}
//////
///////*输入n的值，计算并输出1*1+2*2+3*3+...+n*n的值，使用递归函数解决问题。*/
////////1 4 9 16 25 36
//////// 1-->1
//////// 2-->5
//////// 3-->14
//////// 4-->30
////////函数功能：计算n*n
////////参数  等待输入的数
////////返回值   n*n的值然后累加
////////#include <stdio.h>
////////int chengji(int n);
////////int chengji(int n)
////////{
////////    int number;
////////    number = 0;
////////    if (n == 1)
////////        return 1;
////////    else if(n>=2)
////////    number = n*n;//4和9之间的关系chengji(n-1)
////////        return number;
////////}
////////int main(void)
////////{
////////    int i, sum,n;
////////    sum = 0;
////////    printf("请输入一个数\n");
////////    scanf_s("%d",&n);
////////    //将n次乘积结果累加
////////    for (i = 1; i <= n; i++)
////////    {
////////        sum = sum + chengji(i);
////////    }
////////    printf("计算结果=%d\n",sum);
////////    return 0;
////////}
////////
//////
///////*编写函数（递归）打印斐波拉契数列（1  1  2  3  5  8  13……）的前n项*/
//////////#include <stdio.h>
//////////int rabbit(int n);
//////////int rabbit(int n)
//////////{
//////////    if (n == 1 || n == 2)
//////////        return 1;
//////////    else
//////////        return  rabbit(n - 1) + rabbit(n - 2);
//////////}
//////////int main(void)
//////////{
//////////    int n, number;
//////////    number = 0;
//////////    printf("请输入求第几个斐波那契数列\n");
//////////    scanf_s("%d",&n);
//////////    number = rabbit(n);
//////////    printf("第%d个斐波那契数列=%d\n", n, number);
//////////    return 0;
//////////}
//////
////////一个数如果恰好等于它的因子之和，这个数就称为“完数”。例如6 = 1＋2＋3.编程找出1000以内的所有完数。
////////#include <stdio.h>
////////void wanshu(int n);
////////void wanshu(int n)
////////{
////////    /*分析因数分解
////////    1、找因数：输入一个数n让n%i==0能被整除则i就是它的因数，i从1到n，1和n本身肯定是他的因数
////////    2、求和：除去1和它本身，所有因数相加再加上1如果=n  打印出n*/
//////// 
////////    while (n <= 1000)
////////    {
////////        int i,sum;
////////        sum = 0;
////////        i = 2;
////////        while(i < n)//i从2开始到n-1除去1和它本身
////////        {
////////            if (n % i == 0)//判断因数
////////            {
////////                sum = sum + i;//因数和
////////            }
////////            i++;
////////        }
////////            if (sum + 1 == n)
////////               {
////////                   printf("%d\n", n);
////////               }
////////        n++;
////////    }
//////// 
////////}
////////int main(void)
////////{
////////    int n;
////////    n = 2;
////////    wanshu(n);
////////    return 0;
////////}
//////
//////////设计一个函数，实现输入一个任意进制下的数，输出对应的任意进制下的结果。
////////#include <stdio.h>
////////void jingzhi(int n);
////////void jingzhi(int n)
////////{
////////
////////
////////
////////}
////////int main(void)
////////{
////////    int n;
////////    printf("请输入一个任意进制的数\n");
////////    scanf_s("%d",&n);
////////    jingzhi(n);
////////    return 0;
////////}
//////
//////////一个5位数，判断它是不是回文数。即12321是回文数，个位与万位相同，十位与千位相同。
////////#include <stdio.h>
//////////
////////int main(void)
////////{ 
////////    int n,shi,ge,wan,qian;
////////    shi = 0;
////////    ge = 0;
////////    wan = 0;
////////    qian = 0;
////////    printf("请输入一个5位数\n");
////////    scanf_s("%d", & n);
////////    wan = n / 10000;//万位
////////    qian = (n / 1000) % 10;//千位
////////    shi = (n / 10) % 10;//十位
////////    ge= n % 10;//个位12500  
////////    if ((ge == wan) && (shi == qian))
////////        printf("%d是回文数\n", n);
////////    else
////////        printf("%d不是回文数\n", n);
////////       
////////return 0;
////////}
//////
///////*对10个数进行排序*/
////////从小到大
////////#include<stdio.h>
////////int main() {
////////	int a[10], i, j, b[10]; //定义数组a存放输入的十个数，b存放输出的数组
////////	i = 0;
////////	j = 0;
////////	printf("请输入十个数\n");
////////	//循环存数，每次输入一个，输十次
////////	for (i = 0; i < 10; i++)
////////	{
////////		scanf_s("%d,", &a[i]); //对a数组存值 
////////	}
////////	//外循环   
////////	for (i = 0; i < 10; i++)
////////	{    
////////		b[j] = a[i];         //默认第i个最小 
////////		//循环有比i大的就交换 
////////		for (int k = i + 1; k < 10; k++)  
////////		{     
////////			int temp;//中间变量
////////			if (a[k] < b[j]) 
////////			{
////////				temp = a[k];
////////				a[k] = b[j];
////////				b[j] = temp;
////////			}
////////		}
////////		printf("%6d", b[j]);//中间右对齐6格即空6格
////////	}
////////	return 0;
////////}
//////
////////在C中要声明一个数组，需要指定元素的类型和元素的数量，如下所示：
////////type arrayName[arraySize];
////////这叫做一维数组。arraySize 必须是一个大于零的整数常量
////////建立一个数组，输出数组中每个元素的值
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number[10];//建立十个整型元素的数组
////////    int i, j;
////////    //数组初始化
////////    for (i = 0; i < 10; i++)
////////    {
////////        number[i] = 100 + i;
////////    }
////////    //地址从0开始取到9，并输出
////////    for (j = 0; j < 10; j++)
////////    {
////////        printf("number[%d]=%d\n", j, number[j]);
////////    }
////////    return 0;
////////}
//////
//////////数组长度可以使用 sizeof 运算符来获取数组的长度，例如：
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number[] = { 1,2,3,4,5 };//初始化数组
////////    int lengh;//数组长度
////////    lengh =sizeof(number) / sizeof(number[0]);
////////    printf("数组的长度为%d",lengh);
////////    return 0;
////////}
//////
////////数组是一种一次申请多个变量的方法，数组的使用让我们可以在程序中保留多个变量的值，进行处理，
////////例如给定n个学生的成绩，要求有多少学生超过了平均分,代码如下：
////////#include <stdio.h>
////////int main(void)
////////{
////////    int cj[5] = {0};//数组初始化
////////    int i,n,count;
////////     i = 0;
////////     count = 0;//计数
////////     printf("请输入学生数\n");
////////     scanf_s("%d",&n);//确定总人数
////////    //写入数据
////////    for (i = 0; i < n; i++)
////////    {
////////        scanf_s("%d,", &cj[i]);
////////    }
////////    //求和
////////    double sum;
////////    sum = 0;
////////    for (i = 0; i < n; i++)
////////    {
////////        sum += cj[i];
////////    }
////////    //求平均分
////////    double arg;
////////    arg = sum / n;
////////    //逐次比较每个学生的成绩
////////    for (i = 0; i < n; i++)
////////    {
////////        if (cj[i] > arg)
////////            count++;
////////    }
////////    printf("有%d个学生超过平均分", count);
////////    return 0;
////////}
//////
////////#include <stdio.h>
////////int main(void)
////////{
////////    int a[10] = {1,2,3};
////////    int *p  = NULL;//指针也是一个变量，只不过里面存的是地址，就像int型变量只能存整数一样
////////    //例如 int *p,   *p是一个整型变量，p是指针名
////////    //也就是说,对于指针类型的变量，只能赋值地址数据，因为它里面只能存地址
////////    p = &a[0];//将a[0]这个元素即1的地址取出来，赋值给指针类型的变量p
////////    printf("%p",p);//打印p的地址
////////    return 0;
////////}
//////
//////
//////
//////
////////可将枚举、数组和结构体结合起来使用，例如输入5个人的姓名、学号、成绩，
////////但是光靠记忆是记不住哪个人的成绩是数组中第几个元素：
////////#include <stdio.h>
////////int main(void)
////////{
////////
////////    struct Student
////////    {
////////        char name;
////////        long num;
////////        double grade;
////////    } ST;
////////
////////    struct Student ST =
////////    {
////////        {"zhangsan", 0001, 86},
////////        {"lisi", 0002, 72.5},
////////        {"wangwu", 0003, 60},
////////        {"chenliu", 0004, 23},
////////        {"cuihua", 0005, 92} 
////////    };
////////    enum ST_INDEX
////////    {
////////        zhangsan = 0,
////////        lisi,
////////        wangwu,
////////        chenliu,
////////        cuihua,
////////    };
////////        return 0;
////////}
////////这样通过索引枚举中各个人的名字作为数组中的元素位置即可快速查询某个人的成绩等信息。
//////
////////将一个数组逆序输出
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number[5] = {1,2,3,4,5};
////////    int number2[5] = {0};
////////    int i,j;
////////    i = 4;
////////    j = 0;
////////    while(i>=0)
////////    {
////////        number2[j] = number[i];
////////        printf("%3d", number2[j]);
////////        j++;
////////        i--; 
////////    }
////////    return 0;
////////}
//////
//////
///////*有一个已经排好序的数组。现输入一个数，要求按原来的规律 将它插入数组中。*/
////////把最小的数挤掉,实际上就是传地址
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number[5] = { 1,2,3,4,5 };//从小到大
////////    int number2[5] = {0};
////////    int i,j,n,k;
////////    i = 4;
////////    j = 1;
////////    k = 1;
////////    printf("请输入一个数\n");
////////    scanf_s("%d",&n);
////////    for (i = 4; i>=0;)
////////    {
////////        if (n < number[i])
////////        {
////////            i--;
////////        }
////////        else
////////        {
////////
////////            //下标传递
////////            for (j=1; j<=4;)
////////            {  
////////                    //0 1 2 3 4//下标
////////                   // 1 2 3 4 5//元素
////////                  //  2 3 4 5    <--6
////////                    number[j - 1] = number[j];
////////                   // if(j==4)
////////                    //number[4] = n;
////////                    printf("%3d", number[j]);  
////////                    j++;
////////             }
////////              
////////           }
////////            break;
////////    }
////////  
////////
////////    return  0;
////////}
////////打印出杨辉三角形（行数自定义）　　　
////////#include <stdio.h>
////////int sanjiao(int h,int l);
////////int sanjiao(int h,int l)
////////{
////////    int number;
////////    if (h == 1 || l == 1)
////////    {
////////        number = 1;
////////    }
////////    else
////////    {
////////        number = sanjiao(h - 1, 1) + sanjiao(h - 1, l-1);
////////    }
////////
////////    return number;
////////}
////////int main(void)
////////{
////////    int i,j,n;//i行，j列;
////////    printf("请输入行数\n");
////////    scanf_s("%d",&n);
////////    printf("***********\n");
////////    for (i = 1; i <= n; i++)
////////    {
////////        for (j = 1; j <= i; j++)
////////        {
////////            printf("%4d", sanjiao(i, j));
////////        }
////////        printf("\n");
////////    }
////////    return 0;
////////}
//////
////////输入数组，最大的与第一个元素交换，最小的与最后一个元素交换，输出数组。
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number[5] = {0};
////////    int number2[5] = { 0 };
////////    int i, j,k;
////////    i = 0;
////////    j = 0;
////////    //输入数组
////////    printf("请输入数组的元素\n");
////////    for (i = 0; i < 5; i++)
////////    {
////////        scanf_s("%d,",&number[i]);
////////           // printf("%3d", number[i]);
////////    }
////////    //将数组从小到大排序
////////    for (i = 0; i < 5; i++)
////////    {
////////        number2[j] = number[i];
////////        for (k = i + 1; k < 5; k++)
////////        {
////////            int t;
////////            int max;
////////            if (number[k] < number2[j])
////////            {
////////                t = number2[j];
////////                number2[j] = number[k];
////////                number[k] = t;
////////            }
////////            //if (number[k] > number2[k - 3])
////////            //{
////////            //    //最大的与第一个交换，最小的与最后一个交换 
////////            //    max = number2[k];
////////            //    number2[k] = number2[k - 3];
////////            //    number2[k-3] = max;
////////            //}
////////        }
////////        printf("%3d", number2[j]);
////////    }
//////// 
////////    return 0;
////////}
//////
///////*有n个整数，使其前面各数顺序向后移m个位置，最后m个数变成最前面的m个数*/
////////例如5个数，使得前面3个数向后移动2个位置，最后2个数变成最前面2个数  4 5 1 2 3
////////#include <stdio.h>                                  
////////int main(void)
////////{
////////    int number1[5] = { 1, 6, 8, 4, 5 };//4 5 1 6 8
////////    int number2[5] = {0};
////////    int i, j,m;
////////    i = 0;
////////    j = 0;
////////    m = 2;
////////    if (i < 2)
////////    {
////////        for (i = 0; i < 2; i++)
////////        {
////////            number2[i] = number1[i + 3]; // i+3
////////            printf("%3d", number2[i]);            
////////        }
////////        for (i = 2; i < 5; i++)
////////        {
////////            number2[i] = number1[i - 2];//i-2
////////            printf("%3d", number2[i]);
////////        }
////////    }
////////    return 0;
////////}
////////题目34：有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），1,2,3,--> 1,2,3
////////凡报到3的人退出圈子，问最后留下的是原来第几号的那位。
//////// 
////////题目分析：首先我们可以把1 - n 每个元素先赋值为1；然后查找数到3的人，
////////把他的序号所赋值的1变为0；当还剩下最后一个人时，输出他的序号。
////////围成一个圈，可以使用循环当i循环到n + 1的时候，让i再次等于1，
////////直到只剩下最后一个人，循环break。
//////#include <stdio.h>
//////int main(void)
//////{
//////    int  n;
//////    int number[1000] = {0};
//////    int i,count,yushu;
//////    i = 1;  
//////    printf("请输入人数\n");
//////    scanf_s("%d",&n);
//////    yushu = n;//剩余人数
//////    count = 0;//人数的数
//////    //先写1，然后查找数到3的人即，数次数
//////    for (i = 1; i <= n; i++)
//////    {
//////        number[i]=1;//先给数组赋值1代表初始所有人都存活
//////    }
//////    //开始数
//////    for (i = 1;; i++)
//////    {
//////        if (i == (n + 1))
//////            i = 1;
//////        if (number[i] == 1)//数的数从1开始
//////        {
//////            count++;
//////        }
//////        else//代表序号为i的人已经退出圈子
//////            continue;//退出本次循环
//////        if (count % 3 == 0)//当人数数到3的时候剩余人数减一
//////        {
//////            number[i]=0;
//////            yushu--;
//////        }
//////        if (yushu == 1)//当只剩下一个人时候break结束循环
//////            break;
//////    }
//////    for (i = 1; i <= n; i++)
//////    {
//////        if (number[i] == 1)
//////            printf("最后留下的是原来第%d号位\n", i);
//////    }
//////
//////    return 0;
//////}
//////
////////函数调用赋的值叫实参，就是你实际输入的参数
////////定义函数中的参数叫形参
//////
////////enum　枚举名　{枚举元素1, 枚举元素2, ……};
////////#include <stdio.h>
////////int main(void)
////////{
////////    //定义枚举类型的同时定义枚举变量
////////    enum  DAY//枚举类型,  数据类型为枚举类型,在C 语言中，枚举类型是被当做 int 或者 unsigned int 类型来处理的
////////    {
////////        number1,
////////        number2 = 3,
////////        number3,
////////        number4 = 6,
////////        number5,
////////        number6,
////////
////////    }day;//枚举变量
////////
////////    day = number6;
////////    printf("%d",day);
////////        return 0;
////////}
//////
////////枚举在 switch 中的使用：
////////#include <stdio.h>
////////int main(void)
////////{
////////    enum  color
////////    {
////////        red = 1,
////////        green,
////////        blue,
////////        yellow,
////////    }color_led;
////////    printf("请输入一种颜色:(1:red,2:green:3:blue,4:yellow)\n");
////////    scanf_s("%d", &color_led);
////////    switch (color_led)
////////    {
////////    case red:
////////        printf("红色");
////////        break;
////////    case green:
////////        printf("绿色");
////////        break;
////////    case blue:
////////        printf("蓝色");
////////        break;
////////    case yellow:
////////        printf("黄色");
////////        break;
////////    default:
////////        printf("你没有选择颜色\n");
////////    }
////////    return 0;
////////}
////////两个乒乓球队进行比赛，各出三人。甲队为a,b,c三人，乙队为x,y,z三人。已抽签决定比赛名单。
////////有人向队员打听比赛的名单。a说他不和x比，c说他不和x,z比，请编程序找出三队赛手的名单。
////////#include <stdio.h>
////////int main(void)
////////{
////////    char a, b, c;
////////    for (a = 'x'; a <= 'z'; a++)
////////    {
////////        for (b = 'x'; b <= 'z'; b++)
////////        {
////////            for (c = 'x'; c <= 'z'; c++)
////////            {
////////                if (a != b && a != c && b != c)//三者不同
////////                {
////////                    if (a != 'x' && c != 'x' && c != 'z')//题目要求
////////                    {
////////                        printf(" a PK %c\n ", a);
////////                        printf("b PK %c\n ", b);
////////                        printf("c PK %c\n ", c);
////////
////////                    }
////////                }
////////
////////            }
////////
////////        }
////////    }
////////    return 0;
////////}
//////
////////#include <stdio.h>
////////int main(void)
////////{
////////    enum number
////////    {
////////        number1=1,
////////        number2,
////////        number3,
////////
////////    }number_init;
////////    int a = 1;
////////    enum number num;//定义枚举类型变量num
////////    num = (enum number)a;//将a强转为枚举类型赋值给num
////////    printf("num:=%d", num);//枚举类型用%d作为转义字符
////////    return 0;
////////}
//////
////////多文件编程
////////就是建立多个源文件，在main函数里面调用就行
////////#include "main.h"
////////int main(void)
////////{
////////    /*int a, b;
////////    printf("请输入两个数\n");
////////    scanf_s("%d,%d",&a,&b);
////////    printf("和为%d", add(a, b));*/
//////// /*   int n, sum;
////////    printf("请输入求1到几的阶乘和\n");
////////    scanf_s("%d",&n);
////////    sum = jie_cheng_he(n);
////////    printf("从1到%d的阶乘和=%d\n", n, sum);*/
////////    return 0;
////////}
////////输入使用 scanf() ，是不安全的，因为他在读取字符串的时候不会检查边界，
//////// 可能会造成内存泄露，在 Visual Studio 中编译会报错，推荐使用 scanf_s() 
////////#include "stdio.h"
////////int main(void)
////////{
////////    int number[5] = { 0 };
////////    int i,n;
////////    for (i = 0; i < 5; i++)
////////    { 
////////        printf("请输入第%d个元素\n", i + 1);
////////        scanf_s("%d,", &number[i]);
////////    }
////////    for (i = 0; i < 5; i++)
////////    {
////////        printf("第%d个元素是:%d\n",i+1,*(number+i)); // a[i]==*(a+i)
////////    }
////////    return 0;
////////}
//////
////////数组与地址
///////*当定义一个变量时在内存中为其申请了一块指定大小的空间
//////其空间名为变量名，空间是有一个地址的，地址是其固有属性
//////&：取地址
//////*：取内容，*只能对地址操作
//////数组的定义语句中int a[5]  int a[5]这个整体是数组类型，数组名a的地址等于a[0]的地址
//////在数组中变量名就是地址
//////int 型的数组每个元素的地址都相差4
//////
//////*a==*(&a[0]);
//////a[0]==*a
//////
//////a[0]---*a
//////a[1]---*(a+1)-->>  重要概念：a[i]==*(a+i)
//////                   数组名a的地址等于a[0]的地址即 *a==*(&a[0]);
//////为了增加函数的使用范围传递的形参是 首地址(即int *数组名)+元素的个数(int n)
//////*/
////////
////////#include <stdio.h>
////////
////////int sz(int *number, int n);
////////int sz(int *number, int n)
////////{
////////    int i;
////////            for (i = 0; i < n; i++)//将函数传入参数变成变量可以通用
////////            { 
////////                printf("请输入第%d个元素\n", i+1);
////////                scanf_s("%d", &number[i]);
////////            }
////////            for (i = 0; i < n; i++)
////////            {
////////                printf("第%d个元素是:%d\n",i+1,*(number+i)); //a[i]==*(a+i)
////////            }
////////}
////////int main(void)
////////{
////////    int number[6] = { 0 };
////////    sz(number, 6);
////////    return 0;
////////}
////////
//////
////////char a[] = "xyz", b[] = {'x', 'y', 'z'};
////////#include <stdio.h>
//////////#define SIZE 10
////////        
////////int main(void)
////////{
////////    //char a[] = "xyz";
////////    //char b[] = {'x','y','z'};//字符的Ascll值是以整型打印，3*4=12+1+1+1=15个字符
////////    //printf("%d\n", strlen(a));//strlen打印字符串大小
////////    //printf("%d", strlen(b));
////////    //int a[SIZE];
////////    char a[7] = "abcdef";
////////    char b[4] = "ABC";
////////    strcpy(a, b);// strcpy把含有'\0'结束符的字符串复制到另一个地址空间，返回值的类型为char*  //这里将b中的字符复制到a中直接把它覆盖
////////    printf("%c", a[5]);
////////    return 0;
////////}
//////
////////每行4数个据的形式输出a数组
////////#include <stdio.h>
////////#define   N 12
//////////N个数的数组以每行4个数的形式输出
////////int main(void)
////////{
////////    int a[N];
////////    int i;
////////    //首先，先写入数组
////////    for(i=0;i<12;i++) 
////////    { 
////////        scanf_s("%d,",&a[i]);
////////        printf("%3d", a[i]);
////////        //判断如果(i+1)%4=0就换行
////////        if ((i + 1) % 4 == 0)
////////            printf("\n");
////////    }
////////    return 0;
////////}
////////#include <stdio.h>
////////int main(void)
////////{
////////    int number[2][3] =
////////    { 1,3,4,
////////      2,4,7
////////    };
////////    printf("%d", number[1][2]);
////////    return 0;
////////}
//////
//////
////// //选择排序 
////////数组的排序
//////////从小到大
////////#include<stdio.h>
////////int main() {
////////	int a[10], i, j, b[10]; //定义数组a存放输入的十个数，b存放输出的数组
////////	i = 0;
////////	j = 0;
////////	printf("请输入十个数\n");
////////	//循环存数，每次输入一个，输十次
////////	for (i = 0; i < 10; i++)
////////	{
////////		scanf_s("%d,", &a[i]); //对a数组存值 
////////	}
////////	//外循环 
////////	for (i = 0; i < 10; i++)//依次对比10轮
////////	{    
////////		b[j] = a[i];         //默认第i个最小 
////////		//循环有比i大的就交换 
////////		for (int k = i + 1; k < 10; k++)//每次找一个最小的，剩下的部分再去找最小的
////////		{     
////////			int temp;//中间变量   //将最小的交换位置
////////			if (a[k] < b[j]) 
////////			{
////////				temp = a[k];
////////				a[k] = b[j];
////////				b[j] = temp;
////////			}
////////		}
////////		printf("%6d", b[j]);//中间右对齐6格即空6格
////////	}
////////	return 0;
////////}
////////
////////数组排序
////////冒泡排序***************
////////依次对比相邻的两个元素，若符合排序要求(升序或降序)则不动，
////////若不符合则进行交换
////////进行降序
////////#include <stdio.h>
//////////数组输入
////////void shuru(int *number, int n);
////////void shuru(int *number, int n)
////////{
////////    int i;
////////    for (i = 0; i < n; i++)//将函数传入参数变成变量可以通用
////////    { 
////////        printf("请输入第%d个元素\n", i+1);
////////        scanf_s("%d", &number[i]);
////////    }
////////}
//////////冒泡排序
//////////排序：数组名，元素个数
//////////返回值：空
////////void maopao(int *number, int n);
////////void maopao(int *number, int n)
////////{
////////    int i, j;
////////    int b = 0;//中间变量
////////    //每轮对比n-j次，一共对比n-1轮，例如第一轮对比10-1=9次，一共对比10-1=9轮
////////    for (j = 1; j <= n-1; j++)//从第一轮开始一共对比n-1轮
////////    {
////////        for (i = 0; i < n - j; i++)//第一轮对比7次、第二轮对比6次……
////////        {
////////            //循环体判断a[i]和a[i+1]的大小
////////            if (number[i] < number[i + 1])
////////            {
////////                b = number[i];
////////                number[i] = number[i + 1];
////////                number[i + 1] = b;
////////            }
////////        }
////////    }
////////}
//////////数组输出
////////void shuchu(int *number,int n);
////////void shuchu(int *number,int n)
////////{
////////    int i;
////////    for (i = 0; i < n; i++)
////////    {
////////        printf("第%d个元素是:%d\n", i + 1, *(number + i)); //a[i]==*(a+i)
////////    }
////////}
////////int main(void)
////////{
////////    int number[5] = {0};//数组初始化
////////    shuru(number, 5);//输入
////////    maopao(number, 5);//排序
////////    shuchu(number, 5);//输出
////////    return 0;
////////}
//////
//////
////////#include <stdio.h>
//////////先输入
////////void shuru(int* number, int n);
////////void shuru(int* number, int n)
////////{
////////    int i;
////////    for (i = 0; i < n; i++)
////////    {
////////        printf("请输入第%d个元素\n",i+1);
////////        scanf_s("%d", &*(number+i));//输入
////////    }
////////}
//////////再冒泡排序
////////void maopao(int* number, int n);
////////void maopao(int* number, int n)
////////{
////////    int i, j;
////////    int b;//中间变量
////////    for (j = 1; j < n - 1; j++)//对比n-1轮
////////    {
////////        for (i = 0; i < n - j; i++)//每轮对比n-j次
////////        {
////////            //循环体判断number[i]和number[i+1]的大小
////////            if (number[i] < number[i + 1])
////////            {
////////                b = number[i];
////////                number[i] = number[i + 1];
////////                number[i + 1] = b;
////////            }
////////
////////        }
////////
////////    }
////////}
//////////最后输出
////////void shuchu (int* number ,int n);
////////void shuchu (int* number ,int n)
////////{
////////    int i;
////////    for (i = 0; i < n; i++)
////////    {
////////        printf("第%d个数是%d\n", i + 1, *(number + i));
////////    }
////////}
////////int main(void)
////////{
////////    int number[5] = { 0 };
////////    shuru(number,5);//输入
////////    maopao(number, 5);//排序
////////    shuchu(number, 5);//输出
////////    return 0;
////////}
//////
////////********************************
//////
////////插入排序
////////#include <stdio.h>
//////////输入
////////void shuru(int* number, int n);
////////void shuru(int* number, int n)
////////{
////////    int i;
////////    for (i = 0; i < n; i++)
////////    {
////////        printf("请输入第%d个数\n",i+1);
////////        scanf_s("%d",&*(number+i));
////////    }
////////
////////}
//////////插入排序
////////void charu(int* number, int n);
////////void charu(int* number, int n)
////////{
////////    int i,j,k;
////////    int b;
////////    for (j = 1; j <= n - 1; j++)//一共n-1轮对比
////////    {
////////
////////       for(i=0;i<=j-1;i++)//对比j轮时,则number[0]~number[j-1]为有序序列
////////       {                  //用number[j]与number[0]~number[j-1]对比
////////           if (number[j] > number[i])
////////           {
////////               //找到number[j]的位置应当放在i处
////////               //首先要将number[i]~number[j-1]向后移动
////////               //再将number[j]放在number[i]的位置
////////               b = number[j];//先把较大的数存起来
////////               for (k = j - 1; k >= i; k--)//然后对后面的数依次往后挪
////////               {
////////                   number[k + 1] = number[k];
////////               }
////////               number[i] = b;
////////               break;
////////           }
////////
////////       }
////////    }
////////}
//////////输出
////////void shuchu(int* number, int n);
////////void shuchu(int* number,int n)
////////{
////////    int i;
////////    for (i = 0; i < n; i++)
////////    {
////////        printf("第%d个数是%3d\n", i + 1, *(number + i));
////////    }
////////}
////////int main(void)
////////{
////////    int number[5] = { 0 };//初始化
////////    shuru(number, 5);
////////    charu(number, 5);
////////    shuchu(number, 5);
////////    return 0;
////////}
//////
//////
////////****************************
////////选择排序
////////#include<stdio.h>
//////////输入
////////void shuru(int* a, int n);
////////void shuru(int* a, int n)
////////{
////////	int i;
////////	for (i = 0; i < n; i++)
////////	{
////////		printf("请输入第%d个数\n",i+1);
////////		scanf_s("%d",&*(a+i));
////////	}
////////
////////}
//////选择排序
//////遍历数组，假设当前位置是最大的元素。
//////在未排序的部分中找到最大的元素，记录它的位置。
//////将最大的元素与当前位置交换。
//////重复步骤2和步骤3，直到遍历完整个数组。
//////void xuanze(int* a,int* b ,int n);
//////void xuanze(int* a,int* b, int n)
//////{
//////	int i,j,k;
//////	j = 0;
//////	for (i = 0; i < n; i++)//一共对比n轮
//////	{
//////		b[j] = a[i];  //默认第i个最大
//////		for (k = i + 1; k <  n; k++)////每次找一个最大的，剩下的部分再去找最大的
//////		{
//////			int t;
//////			if (a[k]>b[j])//将二者较大的放前面  a[k]>b[j]
//////			{
//////				t= a[k];                  
//////				a[k] = b[j];
//////				b[j] = t;
//////			}
//////		}
//////		printf("第%d个数是%3d\n",i+1, *(b+j));//打印输出
//////	}
//////}
//////////输出
//////////void shuchu(int* a, int n);
//////////void shuchu(int* a, int n)
//////////{
//////////		int i;
//////////		for (i = 0; i < n; i++)
//////////		{
//////////			printf("第%d个数是%3d\n", i + 1, *(a + i));
//////////		}
//////////}
////////
////////int main(void)
////////{
////////	int a[5] = { 0 };//初始化
////////	int b[5] = { 0 };
////////	shuru(a, 5);
////////	xuanze(a, b,5);
////////	//shuchu(a, 5);
////////	return 0;
////////}
//////
//////
////////int main() 
////////{
////////	int a[10], i, j, b[10]; //定义数组a存放输入的十个数，b存放输出的数组
////////	i = 0;
////////	j = 0;
////////	printf("请输入十个数\n");
////////	//循环存数，每次输入一个，输十次
////////	for (i = 0; i < 10; i++)
////////	{
////////		scanf_s("%d,", &a[i]); //对a数组存值 
////////	}
////////	//外循环 
////////	for (i = 0; i < 10; i++)//依次对比10轮
////////	{    
////////		b[j] = a[i];         //默认第i个最小 
////////		//循环有比i大的就交换 
////////		for (int k = i + 1; k < 10; k++)//每次找一个最小的，剩下的部分再去找最小的
////////		{     
////////			int temp;//中间变量   //将最小的交换位置
////////			if (a[k] < b[j]) 
////////			{
////////				temp = a[k];
////////				a[k] = b[j];
////////				b[j] = temp;
////////			}
////////		}
////////		printf("%6d", b[j]);//中间右对齐6格即空6格
////////	}
////////	return 0;
////////}
//////
//////#include <stdio.h>
////////输入
//////void shuru(int* number, int n);
//////void shuru(int* number, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("请依次输入十个数\n");
//////		scanf_s("%d", &*(number + i));
//////	}
//////}
////////找最大值
//////void max_init(int* number, int n);
//////void max_init(int* number, int n)
//////{
//////	int i,j;
//////	int max;
//////	max = number[0];
//////	for (j = 0; j < n ; j++)
//////	{	
//////		if (max < number[j])
//////		{
//////			max = number[j];	
//////		}
//////	}
//////	printf("最大的值为%d\n", max);
//////}
//////
//////int main(void)
//////{
//////	int number[10] = { 0 };
//////	shuru(number, 10);
//////	max_init(number, 10);
//////	return 0;
//////}
////////
//////
//////有一个排序好的数组，输入一个数插入数组中使得插入后的任然是有序数列
//////刚开始的有序数组其不能是满的如a[10] = {1,3,7,9,10,12,13,14,15}
//////#include <stdio.h>
//////int main(void)
//////{
//////    int n,i,j,k;
//////    int number[10] = {1,3,7,9,10,12,13,14,15};//插入6
//////    printf("请输入一个数\n");
//////    scanf_s("%d", &n);
//////    //先确定n应该放在数组中哪个位置
//////   //用n与数组中的数从number[0]依次比较，找到第一个比n大的数即是n的位置
//////    for (i = 0; i < 9; i++)//循环遍历
//////    {
//////        if(n < number[i])//说明n应该放在下标为i的位置
//////        {
//////            //为n腾出来一块位置
//////           //number[i]~number[n-i]依次向后移动
//////            for (j = 8; j >=i; j--)//从n-i开始到i
//////            {
//////                number[j + 1] = number[j];
//////            }
//////            //将腾出来的number[i]赋值成n
//////            number[i] =  n;
//////            break;
//////        }
//////    }
//////    if (i == 9)//说明n比数组中所有的数都大
//////    {
//////        //b放在数组的最后面
//////        number[9] = n;
//////    }
//////    for (k = 0; k < 10; k++)
//////    {
//////        printf("%3d", number[k]);
//////    }
//////    return 0;
//////}
////
//////字符串的数组表示
/////*
////* 字符串以\0结尾
////1、sizeof----计算数据类型长度
////2、strlen----计算字符串长度
////3、strcpy(x,y)，返回值为x,复制函数,将y的内容复制到x里面
////4、strcat拼接，将\0换成b里面的第一个后面依次拼接打印
////5、strcmp(a,b)，找到a,b中第一个不相同的比较他们的ASCLL码值  a>b  正数，a<b负数  a=b返回0
////6、puts(a);
////*/
//////#define _CRT_SECURE_NO_WARNINGS 1
//////#include <stdio.h>
////////函数功能实现两个字符串数组逐个比较，找到第一个不同的值输出他们的ASCLL码的差值
//////参数：待传入的两个字符数组
////// 返回值：他们的ASCLL码的差值，number1-number2或者是0
//////int strcmp_init(char* number1, char* number2);
//////int strcmp_init(char* number1, char* number2)
//////{
//////	int i = 0;
//////	do
//////	{
//////		if (number1[i] != number2[i])
//////		{
//////			return number1[i] - number2[i];
//////		}
//////		i++;
//////	} while (number1[i] != '\0' && number2[i] != '\0');
//////	return 0;//当两个都相等时直接返回0
//////}
//////int main(void)
//////{
//////	//char a[12] = "12345";
//////	//char b[6] = "12tg5";
//////	//printf("%d\n",strlen(a));//计算字符串长度
//////	//printf("%d",sizeof(a));//计算数据类型长度
//////	//strcpy(a, b);//将b中的内容复制到a
//////	//puts(a);
//////	//puts(b);
//////	//printf("%d\n", a[4]);//	打印5的ASCLL码值
//////	//strcat(a, b);//字符串拼接
//////	//puts(a);
//////	//int i;
//////	//i = strcmp(a, b);//对比字符串
//////	//printf("%d", i);
//////	char a[6] = "12345";
//////	char b[6] = "12tgh";
//////	char c = 't';
//////	/*printf("%d",c);
//////	strcmp_init(a, b);*/
//////	printf("%d", strcmp_init(a, b));
//////	return 0;
//////}
////
////
////
//////#include <stdio.h>
////////函数功能：复制函数strcpy(a,b)将b里面的内容复制给a连\0一起复制
////////参数：待传入的两个字符数组
////////返回值：无直接在函数中打印
//////void strcpy_init(char* number1, char* number2);
//////void strcpy_init(char* number1, char* number2)
//////{
//////	int i = 0;
//////	do//只要number2[i]没有结束就一直赋值且‘\0’应该赋值过去先赋值后判断
//////	{
//////		//循环体赋值操作
//////		number1[i] = number2[i];
//////	} while (number2[i++] != '\0');
//////	puts(number1);
//////	//puts(number2);
//////}
//////
//////int main(void)
//////{
//////	char number1[6] = "12345";
//////	char number2[4] = "25h";
//////	//strcpy(number1, number2);
//////	//puts(number1);
//////	strcpy_init(number1, number2);
//////	return 0;
//////}
////
//////#include <stdio.h>
//////函数功能：strlen 计算字符串的长度即双引号内的字符个数不包括\0
//////参数：待传入的字符数组
//////返回值：字符长度
//////int strlen_init(char* number);
//////int strlen_init(char* number)
//////{
//////	int i = 0;
//////	int count = 0;//计数
//////	while (number[i] != '\0')
//////	{
//////		count++;
//////		i++;
//////	}
//////	return count;
//////}
//////int main(void)
//////{
//////	char number[6] = "12hik";
//////	strlen_init(number);
//////	printf("%d\n", strlen_init(number));
//////	return 0;
//////}
////
////
//////#include <stdio.h>
////////函数功能：数组输入
////////返回值：无
////////参数：待传入的数组
//////void shuru(int* number, int n);
//////void shuru(int* number, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("请输入第%d个数\n", i + 1);
//////		scanf_s("%d",&*(number+i));
//////	}
//////}
////////函数功能：冒泡排序将输入的数组从小到大排序
////////返回值：  无
////////参数：   待传入的数组名，数组大小
//////void maopao(int* number, int n);
//////void maopao(int* number, int n)
//////{
//////	int i, j;
//////	int b;//中间变量
//////	for (j = 1; j < n - 1; j++)//循环比较N-1轮
//////	{
//////		for (i = 0; i < n - j; i++)//每轮循环n-j次
//////		{
//////			//循环体判断比较number[i+1]和number[i]的大小如果后一个比他小就排序
//////			if (number[i + 1] < number[i])
//////			{
//////				b = number[i];
//////				number[i] = number[i + 1];
//////				number[i + 1] = b;
//////			}
//////
//////		}
//////
//////	}
//////}
//////函数功能：依次输出数组
//////返回值：无
//////参数：待传入的数组名和元素个数
//////void shuchu(int* number, int n);
//////void shuchu(int* number, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("第%d个元素是%d\n", i + 1, *(number + i));
//////	}
//////}
//////int main(void)
//////{
//////	int number[10] = { 0 };//数组初始化
//////	shuru(number, 10);//输入
//////	maopao(number, 10);//排序
//////	shuchu(number, 10);//输出
//////	return 0;
//////}
////
////
//////#include <stdio.h>
////////函数功能：函数拼接strcat_init将a中的\0换成b中的第一个字符依次向后拼接
////////返回值： 无
////////参数：  待传入的两个字符数组
//////void strcat_init(char* number1,int n, char* number2,int m);
//////void strcat_init(char* number1,int n, char* number2,int m)
//////{
//////	int i = 0;
//////	while (i<n)//循环条件
//////	{
//////		//循环体
//////		if (i >= m)
//////		{
//////			number1[i] = number2[i-m];
//////		}
//////		i++;
//////	}
//////	puts(number1);
//////	//puts(number2);
//////}
//////int main(void)
//////{
//////	char number1[12] = "12345";
//////	char number2[6] = "gh23d";
//////	strcat_init(number1,12, number2,5);
//////	return 0;
//////}
////
//////#include <stdio.h>
////////函数功能:输入一个二维数组
////////返回值：无
////////参数：待传入的二维数组
//////void shuru(int* number, int m, int n);
//////void shuru(int* number, int m, int n)
//////{
//////	int i, j;
//////	for (i = 0; i < m; i++)
//////	{
//////		for (j = 0; j < n; j++)
//////		{
//////			printf("请输入第%d个元素的第%d个元素\n", i + 1,j+1);
//////			scanf_s("%d",number+(i*n)+j);//地址偏移
//////		}
//////		printf("**************************\n");
//////	}
//////}
////
//////函数功能:输出一个二维数组
//////返回值：无
//////参数：待传入的二维数组
//////void shuchu(int* number, int m, int n);
//////void shuchu(int* number, int m, int n)
//////{
//////	int i, j;
//////	for (i = 0; i < m; i++)
//////	{
//////		for (j = 0; j < n; j++)
//////		{
//////			printf("number[%d][%d]=%d\n", i , j ,*(number+(i*n)+j));
//////		}
//////		printf("**************************\n");
//////	}
//////}
//////int main(void)
//////{
//////	int number[3][4] = { {0} };
//////	shuru(number,3,4);
//////	shuchu(number,3,4);
//////	return 0;
//////}
////
////
//////#include <stdio.h>
////////函数功能：输入一个字符串，判断其中有几个单词
////////返回值：无
////////参数待输入的字符数组
//////void zifu(char* str, int n);
//////void zifu(char* str, int n)
//////{
//////	int i = 0;
//////	int count=0;
//////	while (i < n)
//////	{
//////		if (str[i] == ' ')
//////		{
//////			count++;
//////		}
//////		i++;
//////	}
//////	printf("一共%d个单词\n", count+1);
//////}
//////int main(void)
//////{
//////	char str[19] = "hello world 13";
//////	zifu(str, 19);
//////	return 0;
//////}
////
//////输入数组，最大的与第一个元素交换，最小的与最后一个元素交换，输出数组
//////#include <stdio.h>
////////输入数组
//////void shuru(int* number, int n);
//////void shuru(int* number, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("请输入第%d个元素\n", i + 1);
//////		scanf_s("%d",&*(number+i));
//////	}
//////}
////////函数功能：找最大值的位置，找到number几是最大值
////////返回值：无
////////参数：待输入的数组名 和元素个数
//////int  max_init(int* number, int n);
//////int  max_init(int* number, int n)
//////{
//////	int i,j;
//////	int max;
//////	max = number[0];
//////	for (i = 0; i < n; i++)
//////	{
//////		if (max < number[i])
//////		{
//////			max = number[i];
//////		}
//////	}
//////	for (j = 0; j < n; j++)
//////	{
//////		if (number[j] == max)
//////			break;		
//////	}
//////	//printf("%d", j);
//////	return  j;//返回最大元素的位置
//////	//number[i] = 5;求i
//////	//printf("max=%d\n",max);
//////}
//////
////////函数功能：找最小值的位置
////////返回值：无
////////参数：待输入的数组名 和元素个数
//////int min_init(int* number, int n);
//////int min_init(int* number, int n)
//////{
//////	int i,j;
//////	int min;
//////	int count = 0;
//////	min = number[0];
//////	for (i = 0; i < n; i++)
//////	{
//////		if (min > number[i])
//////		{
//////			min = number[i];
//////		}
//////	}  
//////	for (j = 0; j < n; j++)
//////	{
//////		if (number[j] == min)
//////			break;
//////	}
//////	return j;//返回最小元素的位置
//////	//printf("min=%d\n",min);
//////}
//////
////////函数功能：最大的与第一个元素交换
////////返回值：
////////参数：
//////void jiaohuan_max(int* number, int n);
//////void jiaohuan_max(int* number, int n)
//////{
//////	//通过数组交换最大元素和第一个元素的位置
//////	int t;
//////	int i;
//////	i = max_init(number, n);//首先将最大值的位置坐标赋值给i
//////	t = number[i];//最大值
//////	number[i]=number[0];//
//////	number[0] = t;//最后再将t赋值给number[0]
//////}
////////函数功能：最小的与最后一个元素交换
////////参数：
////////返回值：
//////void jiaohuan_min(int* number, int n);
//////void jiaohuan_min(int* number, int n)
//////{
//////	//通过数组交换最小元素和最后一个元素的位置
//////	int t;
//////	int i;
//////	i = min_init(number, n);//首先将最小值的位置坐标赋值给i
//////	t = number[i];//最小值
//////	number[i] = number[n-1];//
//////	number[n-1] = t;//最后再将t赋值给number[n-1]
//////}
//////
////////数组输出
//////void shuchu(int* number, int n);//数组输出
//////void shuchu(int* number, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("%3d",*(number+i));
//////	}
//////}
//////int main(void)
//////{
//////	int number[5] = { 0 };
//////	shuru(number, 5);//数组输入
//////	jiaohuan_max(number, 5);//计算最大的元素的位置
//////	jiaohuan_min(number, 5);//计算最小的元素的位置
//////	shuchu(number, 5);//数组输出
//////
//////	return 0;
//////}
////
////
//////题目34：有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），1,2,3,--> 1,2,3
//////凡报到3的人退出圈子，问最后留下的是原来第几号的那位。
////// 
//////题目分析：首先我们可以把1 - n 每个元素先赋值为1；然后查找数到3的人，
//////把他的序号所赋值的1变为0；当还剩下最后一个人时，输出他的序号。
//////围成一个圈，可以使用循环当i循环到n + 1的时候，让i再次等于1，
//////直到只剩下最后一个人，循环break。
//////#include <stdio.h>
//////int main(void)
//////{
//////    int  n;
//////    int number[1000] = {0};
//////    int i,count,yushu;
//////    i = 1;  
//////    printf("请输入人数\n");
//////    scanf_s("%d",&n);
//////    yushu = n;//剩余人数
//////    count = 0;//人数的数
//////    //先写1，然后查找数到3的人即，数次数
//////    for (i = 1; i <= n; i++)
//////    {
//////        number[i]=1;
//////    }
//////    //开始数
//////    for (i = 1;; i++)
//////    {
//////        if (i == (n + 1))
//////            i = 1;
//////        if (number[i] == 1)//数的数从1开始
//////        {
//////            count++;
//////        }
//////        else//代表序号为i的人已经退出圈子
//////            continue;//退出本次循环
//////        if (count % 3 == 0)//当人数数到3的时候剩余人数减一
//////        {
//////            number[i]=0;
//////            yushu--;
//////        }
//////        if (yushu == 1)//当只剩下一个人时候break结束循环
//////            break;
//////    }
//////    for (i = 1; i <= n; i++)
//////    {
//////        if (number[i] == 1)
//////            printf("最后留下的是原来第%d号位\n", i);
//////    }
//////
//////    return 0;
//////}
//////
////
////
//////编写一个函数，输入n为偶数时，调用函数求1 / 2 + 1 / 4 + ... + 1 / n, 
//////当输入n为奇数时，调用函数1 / 1 + 1 / 3 + ... + 1 / n(利用指针函数)
////
//////#include <stdio.h>
//////函数功能输入偶数或者奇数调用函数求值
//////返回值：无
//////
//////void qiuzhi(int n);
//////void qiuzhi(int n)
//////{
//////	//首先判断奇数偶数
//////	int flag;//首先定义标志位
//////	flag = 0;
//////	float  sum = 0;
//////		if (n == 0)
//////		{
//////			printf("sum=%f", sum);
//////		}
//////		else if (n%2 == 0)//偶数求值1 / 2 + 1 / 4 + ... + 1 / n
//////		{
//////			//分子：1
//////			//分母：偶数2n//循环n/2次一共这么多数相加
//////			float i;
//////			float m = 0;
//////			for (i = 1; i <= n / 2; i++)
//////			{
//////				m=(1 / (2*i));
//////				sum = sum + m;
//////			}
//////			printf("sum=%f", sum);
//////		}
//////		else//奇数求值1 / 1 + 1 / 3 + ... + 1 / n
//////		{
//////			//分子：1
//////			//分母：奇数2n-1//循环n/2+1次一共这么多数相加
//////			float j;
//////			float x = 0;
//////			for (j = 1; j <= (n/2)+1; j++)
//////			{
//////				x = (1 / (2 * j - 1));
//////				sum = sum + x;
//////			}
//////			printf("sum=%f", sum);
//////		}	
//////}
//////int main(void)
//////{
//////	float n;
//////	printf("请输入一个数\n");
//////	scanf_s("%f",&n);
//////	qiuzhi(n);
//////	return 0;
//////}
////
//////break跳出离他最近的一层循环或者switch case结构，只对循环或者switch结构起作用
//////continue//跳出本次循环直接执行下一次循环
//////#include <stdio.h>
//////int main(void)
//////{
//////	//路 0 箱子 1 人 2  墙 3  终点  4  人在终点  5   箱子在终点  6
//////	int number[10][30] =
//////	{
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3}
//////	};//数组初始化
//////	int i, j;
//////	for (i = 0; i < 10; i++)
//////	{
//////
//////		for (j = 0; j < 30; j++)
//////		{
//////			printf("");
//////		}
//////		printf("\n");
//////	}
//////
//////	return 0;
//////}
////
//////输入15个正整数，放在a数组中，要求:奇数放在a数组前部，
////// 偶数放在a数组后部。再分别对奇数和偶数排序。
//////首先输入时判断奇数偶数再输入，然后对奇数排序，对偶数排序
//////#include <stdio.h>
////
//////m为奇数的个数,15-m为偶数的个数
//////奇数排序
//////函数功能:将数组number前面m个数从小到大排序
//////返回值：无
//////参数：数组名和元素个数
//////void maopao(int* number, int m);
//////void maopao(int* number, int m)
//////{
//////	int i, j;
//////	int b;
//////	for (j = 1; j < m - 1; j++)//循环比较m-1轮
//////	{
//////		for (i = 0; i < m - j; i++)//每轮比较m-j次
//////		{
//////			if (number[i + 1] < number[i])//降序排序
//////			{
//////				b = number[i];
//////				number[i] = number[i + 1];
//////				number[i + 1] = b;
//////			}
//////
//////		}
//////	}
//////}
//////
//////int main(void)
//////{
//////	int number[15] = {0};
//////	int i, j;
//////	int b;//用于暂存输入数据
//////	int m = 0;//奇数的下标
//////	int n = 14;//偶数的下标
//////	for (i = 0; i < 15; i++)
//////	{
//////		printf("请输入第%d个数 ", i + 1);
//////		scanf_s("%d", &b);
//////		if ((b % 2) == 1)//表示是奇数
//////		{
//////			number[m++] = b;//奇数从前面开始放
//////		}
//////		else
//////		{
//////			number[n--] = b;//偶数从后面开始放
//////		}
//////	}
//////	maopao(number, m);//奇数排序
//////	maopao(number + m, 15 - m);
//////	for (j = 0; j < 15; j++)//确保打印15个数据
//////	{
//////		printf("%3d", number[j]);
//////	}
//////	return 0;
//////}
////
//////杨辉三角
//////打印任意行数
//////           1
//////         1 　1
//////       1 　2 　1
//////    1　  3 　3　 1
//////  1　 4    6 　4  1
//////1　 5　 10　10　5 　1
////
//////#include <stdio.h>
//////int main(void)
//////{
//////	int number[30][30] = { 0 };//足够大
//////	int n,i,j;
//////	printf("请输入行数\n");
//////	scanf_s("%d",&n);
//////	for (i = 0; i < n; i++)//循环n行
//////	{
//////		//打印空格
//////		for (j = 0; j < n - (i + 1); j++)
//////		{
//////			printf(" ");//打印空格
//////		}
//////		for (j = 0; j < i + 1; j++)
//////		{
//////			/*规律：j = 0, number[i][j] = 1
//////					i=j,number[i][j]=1
//////					number[i][j] = number[i-1][j]+number[i-1][j-1]*/
//////			if (j == 0)
//////			{
//////				number[i][j] = 1;
//////			}
//////			else if (i == j)
//////			{
//////				number[i][j] = 1;
//////			}
//////			else
//////			{
//////				number[i][j] = number[i - 1][j] + number[i - 1][j - 1];
//////			}
//////			printf("%d ", number[i][j]);//打印数据
//////		}
//////		printf("\n");//一行结束后换行
//////	}
//////	return 0;
//////}
////
////
//////#include <stdio.h>
//////int main(void)
//////{
//////	//路 0 箱子 1 人 2  墙 3  终点  4  人在终点  5   箱子在终点  6
//////	//地图搭建
//////	int number[30][30] =
//////	{
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,1,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{4,1,0,0,0,0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,4},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,1,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
//////	{3,3,3,3,3,3,3,3,3,3,3,3,3,4,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3}
//////	};//数组初始化
//////	//道具初始化
//////	int i, j;
//////	for (i = 0; i < 30; i++)
//////	{
//////
//////		for (j = 0; j < 30; j++)
//////		{
//////			switch (number[i][j])
//////			{
//////				case 0:printf("  "); break;//路
//////				case 1:printf("□"); break;//箱子
//////				case 2:printf("♀"); break;//人
//////				case 3:printf("■"); break;//墙
//////				case 4:printf("☆"); break;//终点
//////				case 5:printf("☆"); break;//人在终点
//////				case 6:printf("★"); break;//箱子在终点
//////			}
//////			//printf("  ");
//////		}
//////		printf("\n");
//////	}
////////热键控制
//////
////
////
//////	//return 0;
//////}
////
////
///////*输入一个数找出1到这个数中所有2的个数*/
//////#include <stdio.h>
////////函数功能：用于查找1-n中2出现的次数
////////返回值：次数
////////参数：输入的值
//////int find2(int n);
//////int find2(int n)
//////{
//////	int i;
//////	int sum;
//////	sum = 0;//计算出现2的次数
//////	for (i = 1; i <= n; i++)
//////	{
//////		sum = sum + find(i);
//////	}
//////	return sum;
//////}
//////
////////函数功能：用于查找2出现的次数
////////返回值：次数
////////参数：输入的值
//////int find(int n);
//////int find(int n)
//////{
//////	int a;//用于暂时存放值
//////	int count;//用于计数
//////	count = 0;
//////	while (n)
//////	{
//////		a = n % 10;//求个位数字
//////		if (a == 2)
//////		{
//////			count++;
//////		}
//////		n = n / 10;//降阶
//////	}
//////	return count;
//////}
//////int main(void)
//////{
//////	int n;
//////	printf("请输入一个正整数\n");
//////	scanf_s("%d",&n);
//////	printf("0~%d中有%d个数字2\n",n, find2(n));
//////
//////	return 0;
//////}
////
//////#include <stdio.h>
////////函数功能：将字符数字转换成整形数
////////返回值：  转换后的数字
////////参数：  待传入的字符数组名以及字符个数
//////int zifu(char* number)
//////{
//////	int len = strlen(number);//计算字符串的长度
//////	int sum = 0;
//////	int i;
//////	for (i = 0; i < len; i++)
//////	{
//////		if (number[i] >= '0' && number[i] <= '9')
//////		{
//////			sum = sum * 10 + number[i] - 48;//将他转换成一个整型的数
//////		}
//////	}
//////	return sum;
//////}
//////int main(void)
//////{
//////	int num;
//////	char number[11] = "ab12c3d4e5";
//////	num = zifu(number);
//////	printf("num=%d", num);
//////	return 0;
//////}
////
////////海滩上有一堆桃子，五只猴子来分。第一只猴子把这堆桃子凭据分为五份，
////////多了一个，这只猴子把多的一个扔入海中，拿走了一份。第二只猴子把剩下的桃子又平均分成五份，
////////又多了一个，它同样把多的一个扔入海中，拿走了一份，第三、第四、第五只猴子都是这样做的，
////////问海滩上原来最少有多少个桃子？
//////#include <stdio.h>
//////int main(void)
//////{
//////
//////
//////
//////}
////
////   
//////计算序列 1 - 1/4 + 1/7 - 1/10 + ... 的前N项之和
//////规律：分子：1， 分母：后一个分母=前一个分母+3
//////#include <stdio.h>
//////#include <math.h>
////////函数功能：计算前n项之和
////////参数：待输入的前几项
////////返回值：前n项之和
//////float num_init(int n);//求和
//////float fenmu(int n);//计算分母
//////float num_init(int n)
//////{
//////	float i;
//////	float sum;
//////	sum = 0;
//////	//偶减奇加
//////	for (i = 1; i <= n; i++)//i=0表示第一项
//////	{
//////		sum = sum + pow(-1, (i + 1)) * (1/fenmu(n));//计算和
//////	}
//////	return sum;
//////
//////}
//////
//////float fenmu(int n)//计算分母
//////{
//////	float zhi;
//////	zhi = 0 ;
//////	if (n == 1)
//////		zhi = 1;
//////	if(n>=2)
//////	zhi = fenmu(n - 1) + 3;
//////	return zhi;
//////}
//////int main(void)
//////{
//////	int n;
//////	printf("请输入求前几项\n");
//////	scanf_s("%d", &n);
//////	float sum;
//////	sum = 0;
//////	sum = num_init(n);
//////	printf("前%d项的和为%f\n", n,sum);
//////	return 0;
//////}
//////
////
//////#include <stdio.h>
////////韩信点兵:相传韩信才智过人，从不直接清点自己军队的人数，
////////只要让士兵先后以三人一排、五人一排、七人一排地变换队形，
////////而他每次只掠一眼队伍的排尾就知道总人数了。输出总人数的最小值（或报告无解）。
////////已知总人数不小于10，不超过100。  3,5,7
//////int main(void)
//////{
//////	int sum;
//////	int i, j, k;//i,j,k代表排尾的人数就是分别以3，5，7人为一排剩下的人数
//////	printf("请输入3人一排排尾人数\n");
//////	scanf_s("%d", &i);
//////	printf("请输入5人一排排尾人数\n");
//////	scanf_s("%d", &j);
//////	printf("请输入7人一排排尾人数\n");
//////	scanf_s("%d", &k);
//////	for (sum = 10; sum <= 100; sum++)
//////	{
//////		if ((sum % 3 == i) && (sum % 5 == j) && (sum % 7 == k))//分别对3，5，7取余数
//////		{
//////			printf("总人数=%d\n", sum);
//////			break;
//////		}
//////	}
//////		if(sum==101)
//////		printf("无解\n");
//////		return 0;
//////}
////
//////求0—7所能组成的奇数个数
////// 0不能在首位
//////该题认为数字可以重复使用，这个问题其实是一个排列组合的问题，
////// 设这个数为sun = a1a2a3a4a5a6a7a8, a1 - a8表示这个数的某位的数值，
////// 当一个数的最后一位为奇数时，那么这个数一定为奇数，不管前面几位是什么数字。
////// 如果最后一位数为偶数，则这个数一定为偶数。a1 - a8可以取0 - 7这个八个数字，
////// 首位数字不为0。即一个a为4种（个位），另一个7种（首位），
////// 从该数为一位数到该数为8位数开始统计奇数的个数：
//////1.当只有一位数时也就是该数的最后一位，奇数个数为4
//////2.当该数为两位数时，奇数个数为4 * 7 = 28
//////3.当该数为三位数时，奇数个数为：4 * 8 * 7 = 224
//////个位： 1，3，5，7
//////#include <stdio.h>
//////int main(void)
//////{
//////	int i,j,k;
//////	long sum = 4;//sum的初始值为4表示，只有一位数字组成的奇数个数为4个
//////	long num = 4;
//////	for (i = 2; i < 8; i++)//直接从2位数开始统计
//////	{
//////		printf("%d位数为奇数的个数%ld\n", i - 1, num);
//////		if (i <= 2)
//////			num = num * 7;
//////		else
//////			num = num * 8;
//////		sum = sum + num;
//////	}
//////	printf("%d位数为奇数的个数%ld\n", i - 1, num);
//////	printf("奇数的总个数为：%ld\n", sum);
//////	return 0;
//////}
////// 
////// 
////
//////一个偶数总能表示为两个素数之和,求100以内满足条件的偶数
////
//////首先求100以内的素数，遍历
//////然后这些素数任意两两组合求和，遍历所有可能
//////最后判断这些所有可能的和为偶数的输出
//////#include <stdio.h>
//////int main(void)
//////{
//////	int i;//作为被除数也就相当于输入的那个数
//////	int j;//作为除数也就是除了1和他本身
//////	int k;
//////	int x;//表示一共有多少个质数
//////	int y;
//////	int z;
//////	int g;
//////	int number[100] = { 0 };//用来储存所有素数
//////	
//////	k = 0;
//////	//求所有素数
//////	for (i = 2; i <=100; i++)//除去1,肯定不是素数
//////	{
//////		for (j = 2; j <= i-1; j++)//除去1和他本身
//////		{
//////			if ((i % j) == 0)
//////			{
//////				break;
//////			}
//////		}
//////			if (j >= i)//如果除数比被除数大则%永远不等于0
//////			{
//////					number[k] = i;//存每次找到的素数
//////					k++;
//////					//printf("%d\n", i);
//////			}
//////		
//////	}
//////			//输出一共存了多少个质数
//////			for (x = 99; x >= 0; x--)
//////			{
//////				if (number[x] != 0)
//////				{
//////					printf("0-100内素数的个数为%d个\n", (x + 1));//一共有多少个质数
//////					break;
//////				}
//////			}
//////			int sum[600] = { 0 };
//////	//将所有素数两两组合求和
//////			for (y = 0; y <= x; y++)//数组下标从0开始遍历,每个下标去除掉他自己和剩下的数进行组合
//////			{
//////					for (z = 0; z <= x; z++)
//////					{
//////						if (y != z)//去除掉自己和自己组合这种情况
//////						{
//////							sum[y+z-1] = number[y] + number[z];//这个求得是y=0，z=0到24中所有数的和，
//////							//所以这里只能存数组里，两两组合每组是24种结果一共有25组
//////							//printf("%3d\n", sum[y+z-1]);//打印存的数据
//////						}
//////
//////					}
//////			}
//////			//判断所有和的可能，是偶数的数-->输出
//////			int count;//记录偶数的个数
//////			count = 0;
//////			for (g = 0; g <=599; g++)
//////			{
//////				if (sum[g] == 0)
//////				{
//////					break;
//////				}
//////				if (sum[g] % 2==0)//判断是否是偶数
//////				{
//////					printf("和为偶数的是-->%d\n", sum[g]);
//////					count++;
//////				}	
//////			}
//////			printf("0-100内素数和是偶数的个数是:%d个\n", count);
//////	return 0;
//////}
////// 
////
//////输入两个有序数组，打印出两个数组合并后的有序数组
////// 如：int a[5] = {1,3,5,7,9}
//////     int b[5] = {2,4,6,8,10}
//////     int 1,2,3,4,5,6,7,8,9,10
//////先输入再排序
//////#include <stdio.h>
//////
//////void zifu(int* a, int m, int* b, int n,int* number,int s);
//////void maopao(int* number, int x);
//////void shuchu(int* number, int n);
////////存入数据
//////void zifu(int* a, int m, int* b, int n,int* number,int s)
//////{	
//////	int i, j, k;
//////	//存数组1
//////		for (j = 0; j < m; j++)
//////		{
//////			number[j] = a[j];
//////		}
//////	
//////	//存数组2
//////		for (k = 0; k < n; k++)
//////		{
//////			number[k+5] = b[k];
//////		}
//////	maopao(number, 10);
//////}
////////冒泡排序
//////void maopao(int* number ,int x)
//////{
//////	int i, j;
//////	int b;//中间变量
//////	for (j = 1; j < x - 1; j++)//比较x-1轮
//////	{
//////		for (i = 0; i < x - j; i++)//每轮比较x-j次
//////		{
//////			if (number[i + 1] < number[i])//降序
//////			{
//////				b = number[i];
//////				number[i] = number[i + 1];
//////				number[i + 1] = b;
//////			}
//////
//////		}
//////	}
//////	shuchu(number, 10);
//////
//////}
//////
////////输出
//////void shuchu(int* number, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("%3d", *(number + i));
//////	}
//////}
//////
//////int main(void)
//////{
//////	int a[5] = { 1,3,5,7,9 };
//////	int b[5] = { 2,4,6,8,10};
//////	int number[10] = { 0 };
//////	zifu(a,5, b, 5,number,10);
//////	return 0;
//////}
////// 
////
//////输入一串字符串，删除其中出现次数最多的字符
//////#include <stdio.h>
//////int main(void)
//////{
//////	char  str[50] = {0};//字符数组的初始化
//////	printf("请输入一串字符\n");
//////	gets(str);
//////	int b[128] = { 0 };//用于保存每种元素出现的次数//128代表128个ASCll码值
//////	int i;
//////	for (i = 0; i < strlen(str); i++)
//////	{
//////		if (b[str[i]] == 0)//例如：b[97]==0  a的ascll码值
//////		{
//////			b[str[i]] = 1;//b[97]==1---ASCLL码值为97的字符出现了一次
//////							//此时保证下次str[i]的ASCLL码值若又是97则进不来if
//////			printf("%c", str[i]);
//////		}
//////	}
//////	return 0;
//////}
////
//////写出二分查找的代码（输出数字在数组中的位置，从0计数）。
//////（二分查找：在有序不重复数列(非混乱数列)中，通过将要
//////查找的数据和中间数据进行比较从而确定要查找的数据所在的区间。
//////比如：在数列1, 2, 3, 4, 5中查找数字4，先用4与3进行比较确定
//////出4在3之后，然后4再与4进行比较找到数字4。）
//////#include <stdio.h>
//////int main(void)
//////{
//////	int a[] = {1,2,3,4,5,6,7,8,9};
//////	int geshu = sizeof(a) / sizeof(a[0]);//计算元素的个数
//////	int k = 0;
//////	printf("请输入想要查找的数\n");
//////	scanf_s("%d",&k);
//////	//(low + high) / 2
//////	int low, high;
//////	low = 0;//左下标
//////	high = geshu - 1;//右下标
//////	while (low <= high)
//////	{
//////		int mid = (low + high) / 2;
//////		if (a[mid] > k)
//////		{
//////			high = mid - 1;
//////		}
//////		else if (a[mid] < k)
//////		{
//////			low = mid + 1;
//////		}
//////		else
//////		{
//////			printf("您找到了，下标是：%d\n", mid);
//////			break;
//////		}
//////
//////	}
//////	return 0;
//////}
////
////////某个公司采用公用电话传递数据，数据是四位的整数，在传递过程中是加密的，
////////加密规则如下：每位数字都加上5, 然后用和除以10的余数代替该数字，
////////再将第一位和第四位交换，第二位和第三位交换。
//////#include <stdio.h>
//////int main(void)
//////{
//////	int n,sum;
//////	printf("请输入一个四位整数\n");
//////	scanf_s("%d",&n);
//////	int qian, bai, shi, ge;
//////	qian = n / 1000;  //5200
//////	qian = (qian + 5)%10;
//////
//////	bai = (n / 100) % 10;
//////	bai = (bai + 5)%10;
//////
//////	shi = (n / 10) % 10;
//////	shi = (shi + 5)%10;
//////
//////	ge = n % 1000;
//////	ge = (ge + 5)%10;
//////
//////	n = ge * 1000 + shi * 100 + bai * 10 + qian;
//////	printf("加密后的密码是%d\n",n);
//////	return 0;
//////}
////// 
////
//////求一个3 * 3矩阵对角线元素之和
//////#include <stdio.h>
//////int main(void)
//////{
//////	int number[3][3] = { 0 };
//////	int sum = 0;
//////	//二维数组输入
//////	int i, j;
//////	for (i = 0;i < 3; i++)//遍历二维数组元素的个数
//////	{
//////		for (j = 0; j < 3; j++)//遍历二维数组元素的元素
//////		{
//////			printf("请输入第%d个元素的第%d个元素\n", i + 1, j + 1);
//////			scanf_s("%d",&number[i][j]);//地址偏移
//////		}
//////		printf("*******************************************\n");
//////	}
//////	
//////	//输出
//////	int m, n;
//////	for (m = 0; m < 3; m++)
//////	{
//////		for (n = 0; n < 3; n++)
//////		{
//////			if (m == n)
//////			{
//////				sum = sum + number[m][n];
//////			}
//////			printf("%3d",number[m][n]);
//////		}
//////		printf("\n");
//////	}
//////	printf("对角线元素之和为%d\n", sum);
//////}
////// 
////// 每份试卷都有一个8位二进制序号，且当且仅当序列号中含有偶数个1时才是有效序列号，
////// 则有效序列号总共有多少？
////// 
////
////////键盘输入一个字符串，编写代码获取字符串的长度并输出，要求使用字符指针实现
//////#include <stdio.h>
//////int main(void)
//////{
//////	char str[50];
//////	char* p = NULL;
//////	p = str;
//////	printf("请输入一串字符\n");
//////	gets(p);
//////	printf("字符串的长度=%d\n", strlen(p));
//////	return 0;
//////}
//////#include <stdio.h>
//////void shuru(int *a, int n);
//////void maopao(int *a, int n);
//////void shuchu(int *a, int n);
//////void shuru(int *a, int n)
//////{
//////	int i, j;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("请输入第%d个数\n", i + 1);
//////		scanf_s("%d",&*(a+i));
//////	}
//////}
//////
//////void maopao(int *a, int n)
//////{
//////	int i, j;
//////	int b=0;
//////	for (i = 1; i < n - 1; i++)//循环遍历n-1轮
//////	{
//////		for (j = 0; j < n - i; j++)//每轮遍历n-i次
//////		{
//////			if (a[i] > a[i + 1])
//////			{
//////				a[i] = b;
//////				a[i] = a[i = 1];
//////				a[i + 1] = b;
//////			}
//////
//////		}
//////
//////	}
//////
//////}
//////void shuchu(int* a, int n)
//////{
//////	int i;
//////	for (i = 0; i < n; i++)
//////	{
//////		printf("第%d个数为：%d\n", i + 1,*(a+i));
//////	}
//////}
//////int main(void)
//////{
//////	int a[10] = { 0 };
//////	shuru(a,10);
//////	maopao(a,10);
//////	shuchu(a,10);
//////	return 0;
//////}
//////
//////将一个正整数分解质因数
//////#include <stdio.h>
//////int main(void)
//////{
//////	int n;
//////	printf("请输入一个数\n");
//////	scanf_s("%d", &n);
//////	int i;
//////	for (i = 2; i < n; i++)
//////	{
//////		if (n % i == 0)
//////		{
//////			printf("质因数有：%d\n", i);
//////			n = n / i;
//////		}
//////	}
//////	return 0;
//////}
////
////
//////一球从100米高度自由落下，每次落地后反跳回原高度的一半；再次落下，求他在第10次落地时
//////共经过多少米，第十次反弹多高
//////#include <stdio.h>
//////int  main(void)
//////{
//////	int h=100;//没落下的高度
//////	int i;
//////	for (i = 1; i < 9; i++)
//////	{
//////		h = h % 2;
//////
//////	}
//////
//////	return 0;
//////}
////
//////#include <stdio.h>
//////void jiaohuan(int* p, int* n);
//////void jiaohuan(int* p, int* n)
//////{
//////	//交换值
//////	int t;//中间变量
//////	t = *p;
//////	*p = *n;
//////	*n = t;
//////}
//////int main(void)
//////{
//////	int a = 3;
//////	int b = 4;
//////	//调用函数传&a,&b;
//////	jiaohuan(&a, &b);
//////	printf("a=%d,b=%d\n", a, b);
//////	return 0;
//////}
////
//////#include <stdio.h>
//////int main(void)
//////{
//////	int a[5] = { 0,1,2 };
//////	int* p,*q;
//////	p = a;
//////	q = &a[4];
//////	printf("%d", q - p);//指针相减表示两个地址相差的距离
//////
//////	return 0;
//////}
////// 
////
////////用C语言写一个a<b的宏
//////#define MIN (a,b)?a:b
//////#include <stdio.h>
//////int main(void)
//////{
//////	int a = 3;
//////	int b = 5;
//////	printf("%d", MIN);
//////	return 0;
//////}
//////size_t strlen(const char *string);
//////函数功能计算字符数组的长度，用指针
//////#include <stdio.h>
//////void zifu();
//////void zifu()
//////{
//////	char* p;
//////	char a[] = "1tdgef";
//////	p = a;
//////	int i = 0;
//////	while (a[i] != '\0')
//////	{
//////		//printf("%s", p);
//////		i++;
//////	} 
//////	printf("%d",i);
//////}
//////
//////int main(void)
//////{	
//////	 zifu();
//////	//char a[] = "hwbiakj12";
//////	//printf("%d", strlen(a));
//////	return 0;
//////}
////
//////int findchar(char **strings, char value)
//////#include <stdio.h>
////////函数功能在字符串中查找特定字符的值
////////返回值：无
////////参数：待查找的字符串，待找的特定字符
//////void find_init(char* p, char a);
//////void find_init(char* p, char a)
//////{
//////	int i=0;
//////	int count = 0;
//////	while (*(p+i) != '\0')
//////	{
//////		if (*(p + i) ==a)
//////			count++;
//////			i++;
//////	}
//////	printf("字符%c出现了%d次",a,count);
//////	//输出该字符出现了几次
//////}
//////int main(void)
//////{
//////	char* a = "12345kkdkui";
//////	find_init(a, 'k');
//////	return 0;
//////}
//////
////
//////#include <stdio.h>
//////int main(void)
//////{
//////	char* c[] = {"ENTER","NEW","POINT","FIRST"};
//////	char** cp[] = {c+3,c+2,c+1,c };
//////	char*** cpp = cp;
//////	printf("%s\n",**++cpp);
//////	printf("%s\n", *-- *++cpp+3);
//////	printf("%s\n", *cpp[-2]+3);
//////	printf("%s\n", cpp[-1][-1]+1);
//////	return 0;
//////}
////
//////#include <stdio.h>
////////#define  A  
//////int a = 5;
//////char* RetMemory(void);
//////void Test(void);
//////char* RetMemory(void)
//////{
//////    char p[] = "hello world";
//////    return p;
//////}
//////void Test(void)
//////{
//////    char* str = NULL;
//////    str = RetMemory();
//////    puts(str);
//////}
//////int main(void)
//////{
//////    Test();
//////	return 0;
//////}
//////在str1中找str2如果找到返回str2第一个字符的地址如果找不到就返回NULL
//////#include <stdio.h>
//////char* str_init(char* a,char* b)
//////{
//////	int i = 0;
//////	int j = 0;
//////	int count = 0;
//////	//检测str2的不包含\0的长度
//////	do
//////	{
//////		count++;
//////	} while (*(b+count)!= '\0');
//////	//printf("%d\n", count);
//////	int flag = 0;
//////	//在str1中遍历str2
//////	do
//////	{
//////		
//////		int xia_biao = 0;
//////		if (*(a+i) == *b)//找到第一个相同的元素//判断他是不是
//////		{
//////			flag = 1;
//////			for (j = 1; j < count; j++)//str2一共有count个元素
//////			{
//////				if(*(a+(i+j)) == *(b+j))
//////				{
//////					flag++;
//////					//找到第一个相等字符的下标
//////					if (flag == count)//证明str1和str2的几个元素都相等
//////					{
//////						xia_biao = i;//记录这时候的下标，这个下标就是我第一个元素的下标
//////						return  (a+i);//返回str2第一个字符的地址
//////					}
//////					else
//////					{
//////
//////					}
//////				}
//////				else//如果不满足flag清零
//////				{
//////					flag = 0;//
//////					break;
//////				}
//////			}
//////		}
//////	
//////		
//////		i++;
//////	} while (*(a + i) != '\0');return NULL;
//////}
//////int main(void)
//////{
//////	char str1[] = "abcdefg";
//////	char str2[] = "def";
//////	char* p = str_init(str1, str2);
//////	printf("%p\n", &str1[3]);
//////	printf("%p\n",p);
//////	return 0;
//////}
////
//////typedef struct node {
//////	int data;
//////	struct node* next;
//////} Node;
////////在链表第n个位置插入一个节点，
////////并返回链表的头指针，Node* list_add(Node* List, int n, value);
//////#include <stdio.h>
//////typedef struct stu
//////{
//////	char name[20];
//////	float cj;
//////	int xh;
//////	struct stu* next;//用于保存节点
//////}STU;
//////
//////void shuru(STU* head);
//////STU* cha_ru(STU* head);
//////void shuchu(STU* head);
//////void shuru(STU* head)
//////{
//////	STU* p =(STU*)malloc(sizeof(STU));
//////	p->next = NULL;//保存地址域为空的地址
//////	STU*q = head;
//////	int i;
//////	//创建3个节点再插入一个节点
//////	while (q->next != NULL)
//////	{
//////		q = q->next;
//////	}
//////	q->next = p;//尾节点地址域要写空
//////	//每一个节点要做的事
//////	printf("请输入姓名：\n             ");
//////	rewind(stdin);
//////	gets(p->name);
//////}
//////
////////有限次链表循环输入
//////// 输入完成后，再输入选择第几个位置插入，
//////// 此时创建一个新节点//并且将后面的节点向后移动一位，并返回链表的头指针
////////在链表第n个位置插入一个节点，并返回链表的头指针
//////STU* cha_ru(STU* head)
//////{
//////	STU* k = head;
//////	int i;
//////	int n;
//////	printf("请输入想要插入的位置\n");
//////	scanf_s("%d", &n);
//////	//找到想要插入的位置
//////	for (i = 0; i < n; i++)
//////	{
//////		k = k->next;
//////	}
//////	//申请一个新的节点
//////	STU* r = (STU*)malloc(sizeof(STU));
//////	//比如输入2就在2-3中间插入一个节点，
//////	//首先将第2个节点的next给新插入节点的next
//////	//然后将新插入节点的头再给第2个节点的next
//////	r->next=k;//k->next
//////	k= r;//k->next
//////	printf("请输入姓名：\n             ");
//////	rewind(stdin);
//////	gets(r->name);
//////	return   head->next;
//////}
////////输出
//////void shuchu(STU* head)
//////{
//////	STU* r = head;
//////	while (r->next != NULL)
//////	{
//////		printf("\n");
//////		printf("//********************\n");
//////		printf("%s", r->name);
//////		r = r->next;
//////	}
//////	//printf("//********************\n");
//////	//printf("\n");
//////}
//////int main(void)
//////{
//////	STU* head = (STU*)malloc(sizeof(STU));
//////	head->next = NULL;//给节点地址域初始化为NULL
//////	int count = 0 ;
//////	int j,k;
//////	for (j = 0; j < 3; j++)
//////	{
//////		shuru(head);
//////		count++;
//////		if (count == 3)
//////		{
//////			break;
//////		}
//////	}
//////	//cha_ru(head);
//////
////////验证1、打印全部的**********判断次数  2、打印输入的内容name验证
//////	for (k = 0; k < 4; k++)
//////	{
//////		shuchu(head);
//////		//插入后原来2（最后）的位置移动到3的位置	
//////	}
//////	
//////
//////
//////	return 0;
//////}
////
//////实现把字符串转换为整数函数,不使用任何函数
////
//////函数功能：实现把字符串转换为整数函数
//////参数：待传入的字符串
//////返回值：无
//////void atoi_rewrite(char* str)
//////{
//////	int i = 0;
//////	while (str[i] != '\0')//循环检测每个字符
//////	{
//////		printf("%d ", str[i]);
//////		i++;
//////	}
//////}
////
//////数列F0=1，F1=1，F2=2，...,Fn = Fn-1 + Fn-2,(n >= 2),实现函数int F(int n),返回数列Fn点的数值；
//////函数功能：返回第n个数列的值
//////返回值：返回第n个数列的值
//////参数  n
//////int F(int n)
//////{
//////	if (n == 0 || n == 1)
//////	{
//////		return 1;
//////	}
//////	if(n>=2)
//////	{
//////		return (F(n - 1) + F(n - 2));
//////	}
//////}
//////#include "stdio.h"
//////int main(void)
//////{
//////	/*char str[10] = "abcd";
//////	atoi_rewrite(str);*/
//////	int n;
//////	printf("请输入一个数：");
//////	scanf_s("%d",&n);
//////	printf("%d\n", F(n));
//////	return 0;
//////}
//////
//////有一个数组，里面存放着N个正整数，随机选取相邻两个数相乘后加1，
//////替换掉之前的两个数，数组长度变为N - 1，重复上述操作，直至数组长度变为1为止，
//////如何保证最后得的那个数最大？
//////e.g. {1, 2, 3, 4, 5} = > {1 * 2 + 1, 3, 4, 5} = > {3 * 3 + 1, 4, 5} = > {10, 4 * 5 + 1} = > {10 * 21 + 1} = > {211}
//////int getMaxResult(int* array, int N);
//////#include "stdio.h"
//////函数功能：找最大首先考虑排序，用大的替换小的再相乘会更大
//////参数： 待传入的数值
//////返回值：无

//void  getMaxResult(int* arry, int N)
//{
//	int i, j,b;
//	for (i = 1; i <= N - 1; i++)
//	{
//		for (j = 0; j < N - i; j++)
//		{
//			if (*(arry + j) > *(arry + (j + 1)))
//			{
//				b = arry[j];
//				arry[j] = arry[j + 1];
//				arry[j + 1] = b;
//			}
//		}
//	}
//	i = 0;
//	j = 0;
//	int count = 0;
//		//先从大的覆盖小的如果前面的数比后面一位还大就继续在后面找
//		//每一次覆盖之后空间减小一位
//		for (i = 0; i < N - 2; i++)//操作n-1次，从0到n-2共n-1次
//		{
//			arry[i+1] = arry[i]* arry[i + 1] + 1;
//			count++;
//			if (count == 3)
//			{
//				break;
//			}
//			if (arry[i+1]>arry[i+2])
//			{
//				arry[i+2]=arry[i + 2] * arry[i + 3] + 1;
//			}
//		}
//		printf("%d",*(arry+N-2));
//}


//int main(void)
//{
//	//int num[5] = {3,2,1,4,5};//放到下标为n-3位上面
//	//getMaxResult(num, 5);
//	float x;
//	x = 10 / 4;
//	printf("%f", x);
//	return 0;
//
//}
////
////
//////链表节点插入
//////Node * list_add(Node *List, int n,int value)
//////{
//////	Node* New = malloc(sizeof(Node));
//////	New->data = value;
//////	Node* Temp = List;
//////	if (n == 0)
//////	{
//////		New->next = List;
//////		return New;
//////	}
//////	else
//////	{
//////		for (u8 i = 0; i < n - 1; i++)
//////		{
//////			List = List->next;
//////		}
//////		New->next = List->next;
//////		List->next = New;
//////		return Temp;
//////	}
//////}
////
//////图片偏移，W大图长，H大图宽，w小图长，h小图宽，x,y小图最终偏移坐标，dest存放第一个x,y坐标点，src，保存初始坐标点
//////void cpoyBitmap(int W，int H，int w，int  h，int x， int y，char* dest，char* src)
//////{
//////	dest += (y * W) + x;
//////	int x1 = x;
//////	for (int i = 0; i < w * h; i++)
//////	{
//////		*dest = *src;
//////		dest++;
//////		src++;
//////		x++;
//////		if ((i % (w - 1) == 0) && (i != 0))
//////		{
//////			y++;
//////			x = x1;
//////			dest += (W - w);
//////		}
//////	}
//////}
////// 
//////************************************
//////链表增加节点

//#include <stdio.h>
//#include <stdlib.h>
//typedef struct stu
//{
//	char name[20];
//	float cj;
//	int xh;
//	struct stu* next;
//}STU;
//
//void shuru(STU* head);
//void shuchu(STU* head);
//STU* charu(STU* head, int n, int value);
//
//STU* charu(STU* head, int n)
//{
//	STU* new = (STU*)malloc(sizeof(STU));
//	new->next = NULL;
//	printf("请输入一个姓名:\n");
//	rewind(stdin);
//	gets(new->name);//节点写入
//	
//	STU* temp = head;//中间变量保存头节点位置
//	//第一个位置
//	if (n == 1)
//	{
//		new->next = head;
//		return new;
//	}
//	//其他中间位置
//	else
//	{
//		//先找到要插入的位置
//		for (int i = 0; i < n - 1; i++)
//		{
//			head = head->next;
//		}
//		new->next = head->next;
//		head->next = new;
//		return temp;
//	}
//}
//
//void shuru(STU* head)
//{
//	STU* q = head;
//
//	while (q->next != NULL)
//	{
//		q = q->next;
//	}
//	STU* p = (STU*)malloc(sizeof(STU));
//	p->next = NULL;
//	q->next = p;//尾节点写空
//	printf("请输入一个姓名：  ");
//	gets(p->name);
//	rewind(stdin);
//}
//
//void shuchu(STU* head)
//{
//	STU* r = head;
//	while (r->next != NULL)
//	{	
//		printf("%s\n",r->name);
//		printf("\n");
//		r = r->next;
//	}
//	printf("%s\n", r->name);
//}
//int main(void)
//{
//	//创建头节点
//	STU* head = (STU*)malloc(sizeof(STU));
//	head->next = NULL;//尾地址写空
//	STU* p = head;
//	printf("请输入一个姓名：  ");
//	gets(p->name);
//	rewind(stdin);
//	unsigned int i = 2;
//	//循环输入3个节点
//	while (i--)
//	{
//		shuru(head);
//	}
//	int n;
//	printf("请输入要插入的位置\n");
//	scanf_s("%d", &n);
//	STU* value = charu(head, n);
//	printf("输入1打印: ");
//	char a;
//	a = getchar();
//	rewind(stdin);
//	if (a == '1')
//	{
//		shuchu(value);
//	}
//	return 0;
//}

//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//typedef struct stu
//{
//	char name[20];
//	float cj;
//	int xh;
//	struct stu* next;
//}STU;
//
//void shuru(STU* head);
//void shuchu(STU* head);
//STU* create_link_head1(void);
//
//void shuru(STU* head)
//{
//	STU* ptemp = head;
//	STU* p;
//
//	while (ptemp->next != NULL)
//	{
//		ptemp = ptemp->next;
//	}
//	p = (STU*)malloc(sizeof(STU));
//	printf("请输入姓名：\n");
//	gets(p->name);
//	p->next = NULL;
//	ptemp->next = p;
//}
//
//void shuchu(STU* head)
//{
//	STU* ptemp = head;
//
//	while (ptemp->next != NULL)
//	{
//		printf("姓名：%s\n", ptemp->name);
//		ptemp = ptemp->next;
//	}
//	printf("姓名：%s\n", ptemp->name);
//}
//int main(void)
//{
//	//创建节点
//	struct STU* phead;// 链表头 
//	struct STU* ptemp;// 链表头 的中间变量
//	// 调用一次就创建一条链表
//	phead = create_link_head1();
//	ptemp = phead;
//	int i = 3;
//	//循环输入3个节点
//	while (i)
//	{
//		shuru(ptemp);
//		i--;
//	}
//	shuchu(ptemp);
//	return 0;
//}
//
//// 创建一个链表头
//STU* create_link_head1(void)
//{
//	STU* p;
//	p = (STU*)malloc(sizeof(STU));
//	printf("请输入姓名：\n");
//	gets(p->name);
//	p->next = NULL;
//	return p;
//}

//链表删除
//常见删除方法是将定位到要删除节点的上一个节点，将上一个节点的next 指针直接指向要删除节点的下一个节点

//#include <stdio.h>
//#include <stdlib.h>
//typedef struct stu
//{
//	char name[20];
//	float cj;
//	int xh;
//	struct stu* next;
//}STU;
//
//void shuru(STU* head);
//void shuchu(STU* head);
//STU* shanchu(STU* head, int n, int value);
//
//STU* shanchu(STU* head, int n)
//{
//	STU* p = head;
//	STU* newhead = head;//创建一个新头,初始化为head
//	STU* q = head;
//	int delete = 1;//要删除的位置
//		//先找到要删除的位置
//		while(p->next!=NULL)
//		{
//			q = p;//q跟着变化保存上一个p的位置
//			p = p->next;
//			if (delete == n)//如果找到跳出
//				break;
//			else
//				delete++;//如果没找到delete++
//		}
//		//删除节点
//		if (n == 1)
//		{
//			newhead = p;
//		}
//
//		if (n > 1)
//		{
//			q->next = p->next;
//		}
//		return newhead;//返回头节点
//}
//
//void shuru(STU* head)
//{
//	STU* q = head;
//
//	while (q->next != NULL)
//	{
//		q = q->next;
//	}
//	STU* p = (STU*)malloc(sizeof(STU));
//	p->next = NULL;
//	q->next = p;//尾节点写空
//	printf("请输入一个姓名：  ");
//	gets(p->name);
//	rewind(stdin);
//}
//
//void shuchu(STU* head)
//{
//	STU* r = head;
//	while (r->next != NULL)
//	{
//		printf("%s\n", r->name);
//		printf("\n");
//		r = r->next;
//	}
//	printf("%s\n", r->name);
//}
//int main(void)
//{
//	//创建头节点
//	STU* head = (STU*)malloc(sizeof(STU));
//	head->next = NULL;//尾地址写空
//	STU* p = head;
//	printf("请输入一个姓名：  ");
//	gets(p->name);
//	rewind(stdin);
//	unsigned int i = 2;
//	//循环输入3个节点
//	while (i--)
//	{
//		shuru(head);
//	}
//	int n;	char a;
//	printf("请输入要删除的位置\n");
//	scanf_s("%d", &n);
//	STU* value = shanchu(head, n);
//	printf("输入1打印: ");
//	rewind(stdin);
//	a = getchar();
//	
//	if (a == '1')
//	{
//		shuchu(value);
//	}
//	return 0;
//}
//

//#include <stdio.h>
//
//typedef struct set
//{
//	int a[20];
//	char b;
//}SET;
//int main(void)
//{
//	/*int _int;
//	double int_;
//	char For;
//	float US$;*/
//	SET  p = { 0,"zs" };
//	SET* q = (SET*)malloc(sizeof(SET));
//	char str;
//	str = q->b;
//	printf("%p\n", q);
//	printf("Hello world!\n");
//	return 0;
//}

//#include <stdio.h>
//#include <stdio.h>
//#include <string.h>
//
//void Find_ZF(char* str)
//{
//	int max = 0;
//	char buff[128] = { 0 };
//	//遍历的目的：每个字符的次数统计(考虑ASCII)
//	while (*str != '\0')
//	{
//		buff[*str] += 1;//因为ASCLL码值是唯一的
//		str++;
//	}
//	// ff存放每个字符出现的次数（基于ASCII)
//	for (int i = 0; i < 128; i++)
//	{
//		if (buff[i] > max)
//			max = buff[i];
//	}
//	for (int j = 0; j < 128; j++)
//	{
//		if (buff[j] == max)
//			printf("%c\r\n", j);
//	}
//}
//int main(void)
//{
//	char buff[] = "abccccddddee";
//	Find_ZF(buff);
//	return 0;
//}
//
//4. 写一个函数，统计一个int类型的值中有多少位为1
////代码：
//#include <stdio.h>
//int  num(int data);
//int  num(int data)
//{
//	int sum = 0 ;
//	while (data)
//	{
//		if (data & 1)
//			sum++;
//		data >>= 1;
//	}
//	return sum;
//}
//
//
//int main(void)
//{
//	int n;
//	printf("请输入一个数\n");
//	scanf_s("%d", &n);
//	//这里的1是二进制中1的个数
//	printf("该数中有%d位是1",num(n));
//}

/*重写如  strcpy strlen strcat strcmp puts sizeof
1、sizeof----计算数据类型长度
2、strlen----计算字符串长度
3、strcpy(x,y)，返回值为x,复制函数,将y的内容复制到x里面
4、strcat拼接，将\0换成b里面的第一个后面依次拼接打印
5、strcmp(a,b)，找到a,b中第一个不相同的比较他们的ASCLL码值  a>b  正数，a<b负数  a=b返回0
6、puts(a);
*/
//#define _CRT_SECURE_NO_WARNINGS 1//防止strcpy报错
//#include <stdio.h>
//#include <string.h>
//int str_len(char* str);
//char* str_cpy(char* str, char* rec);
//char* str_cat(char* str, char* rec);
//int str_cmp(char* str, char* rec);
///*重写strlen函数   （命名为str_len）
//函数功能：计算字符串长度，不包括'\0'
//返回值：字符串长度
//参数：char*
//*/
//int str_len(char* str)
//{
//	int num = 0;
//	while (*str != '\0')
//	{
//		str++;
//		num++;
//	}
//	return num;
//}
///*重写strcpy函数   （命名为str_cpy）
//函数功能：将字符串b拷贝到字符串b中
//返回值：字符串a的首元素地址
//参数：char*
//*/
//char* str_cpy(char* str,char* rec)
//{
//	 int i = 0;
//	do
//	{
//		str[i] = rec[i];
//		i++;
//	} while (rec[i] != '\0');
//	return str;
//}
//
///*重写strcat函数   （命名为str_cat）
//函数功能：将字符串b追加到字符串a后面，注意b的第一个字符会覆盖a的\0
//返回值：字符串a的首元素地址
//参数：char*
//*/
//char* str_cat(char* str, char* rec)
//{
//	int len = 0;
//	int i = 0;
//	while (*(rec+i) != '\0')
//	{
//		len++;
//		i++;
//	}
//	i = 0;
//	do
//	{
//		*(str + (i+len)) = *(rec + i);
//		i++;
//	} while (*(rec + i) != '\0');
//	return  str;
//}
//
///*重写strcmp函数   （命名为str_cmp）
//函数功能：比较两个字符串大小， s1 > s2   正数    s1 < s2   负数    s1 == s2   0
//返回值： int 
//参数：char*
//*/
//
//int str_cmp(char* str, char* rec)
//{
//	int len1 = 0;
//	int len2 = 0;
//	while (*str!='\0')
//	{
//		len1++;
//		str++;
//	}
//	while (*rec != '\0')
//	{
//		len2++;
//		rec++;
//	}
//	return len1 - len2;
//}
//
//int main(void)
//{
//	char str[] = "123456";
//	char rec[] = "abcdefghrt";
//	//printf("字符串长度为:%d\n",str_len(str));
//	/*char* p = str_cpy(str, rec);
//	while (*p!= '\0')
//	{
//		printf("%c ", *p);
//		p++;
//	}*/
//
//	//char* q =  str_cat(str,rec);
//	//while (*q!= '\0')
//	//{
//	//	printf("%c ", *q);
//	//	q++;
//	//}
//	int temp = str_cmp(str, rec);
//	if (temp > 0)
//	{
//		temp = 1;
//	}
//	else if(temp<0)
//	{
//		temp = -1;
//	}
//	switch (temp)
//	{
//		case -1:printf("s1<s2\n"); break;
//		case 0:	printf("s1=s2\n"); break;
//		case 1:	printf("s1>s2\n"); break;
//	}
//	return 0;
//}
//

//
///*1.描述两个栈如何实现队列功能（功能：入队，出队）
//2.从键盘输入一个字符串，将小写字母转为大写字母，
//然后输出到一个磁盘文件“text.h”中保存，输入的字符串要以“！”结尾*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//struct stu
//{
//	int a;
//};
///*
//函数功能：小写字母转为大写字母
//返回值：void
//参数：void  a=97->z=122,A=65->Z=90
//*/
//void find_str(void)
//{
//	struct stu  b;
//
//	char a[20] = {0};
//	char* p = a;
//	printf("请输入一串字符\n");
//	gets(a);
//	//遍历字符串
//	do
//	{
//		if (*p >= 97 && *p <= 122)//小写字母
//		{
//			*p = *p - 32;
//		}
//		p++;
//	}while (*p != '\0');
//	puts(a);
//	//打开文件
//	FILE* fp = fopen("D:\\zhuo-mian\\text.h", "r+");
//	fputs(a, fp);
//	//关闭文件
//	fclose(fp);
//	/*三个特殊的文件指针
//	stdin    标准输入  
//	stdout   标准输出 
//	stderr   标准错误
//	*/
//}
//
//int main(void)
//{
//	find_str();
//	return 0;
//}

///*C语言文件操作，文件打开、关闭、读取、定位如何操作？*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//typedef struct std
//{
//	char name[20];
//	char sex[4];
//	int age;
//}STD;
//
//
//struct ser
//{
//	char nam[20];
//	char s[4];
//	int a;
//}ser1,ser2;
//
//
//typedef union fll
//{
//	char xin[6];
//	char sec[6];
//	int cj;
//}FLL;
//int main(void)
//{
////	//打开文件
////	/*
////	FILE* fopen(const char* filename, const char* mode)//FILE是一个结构体
////	该函数返回一个 FILE 指针。否则返回 NULL，且设置全局变量 errno 来标识错误
////	filename -- 字符串，表示要打开的文件名称。
////	mode -- 字符串，表示文件的访问模式，可以是以下表格中的值：
////	"r"	打开一个用于读取的文件。该文件必须存在。
////	"w"	创建一个用于写入的空文件。如果文件名称与已存在的文件相同，则会删除已有文件的内容，文件被视为一个新的空文件。
////	"a"	追加到一个文件。写操作向文件末尾追加数据。如果文件不存在，则创建文件。
////	"r+"	打开一个用于更新的文件，可读取也可写入。该文件必须存在。
////	"w+"	创建一个用于读写的空文件。
////	"a+"	打开一个用于读取和追加的文件。
////	*/
////	//注意路径要用\隔开，最后要添加文件类型
//	FILE *fp = fopen("D:\\zhuo-mian\\text.h","r+");
//	if (fp == NULL)
//	{
//		printf("打开文件失败\n");
//		return 0;
//	}
////	//打开到关闭中间执行你的操作，相当于开辟内存一样
////	//这里读取文件，读取一个字符//
////	//分行读取fgtec()//读完之后会将文件指针移动到下一个字符
////	//char ch = fgetc(fp);//返回值是一个字符
////	//循环读取
////	//char ch;
////	//while (EOF != ( ch = fgetc(fp)))
////	//{
////	//	printf("%c", ch);
////	//}
////	////分行读取fgtes()//读完之后会将文件指针移动到下一行的开头
////	//char str[30];
////	////char str[30] = {0};//1、直接清零
////	//memset(str, 0, sizeof(str));//2、memset清空数组
////	//fgets(str,30,fp);	
////	//printf("%s", str);
////	//fread()读取指定文件中多少字节的数据
//////str保存读到的数据，1每次度1个字节，20一共读20个占1个字节的数据，fp指向操作文件
////	//返回实际读取的大小,如果返回烫，1、数组没有初始化
////	//fread(str, 1, 20, fp);
////	//printf("%s\n", str);
////	// 
////	//写文件，写入一个字符,清空写
////	//fputc('a',fp);
////	//fputc('b',fp);
////	//fputc('c',fp);
////	////写入一个字符串
////	//char* str = "123abc\n";
////	//fputs(str, fp);//该函数返回一个非负值，如果发生错误则返回 EOF。
////	//fputs(str, fp);
////
////	//把 ptr 所指向的数组中的数据写入到给定流 stream 中。
////	/*fwrite(str, 1, strlen(str), fp);*/
////	//int num = 1073741824;
////	//fwrite(&num, 4, 1, fp);//单个元素的大小4字节//元素的个数1
////
////	////文件指针定位,写完之后不会覆盖，会偏移到下一个
////	//fseek(fp, 0, SEEK_SET);
////	//int num2;
////	//fread(&num2, 4, 1, fp);
////	//printf("%d\n", num2);
////	 
//	//STD person = { "张三","男",20 };
//	//FLL per = { "张三"};
//	////fwrite(&person, 1, sizeof(person), fp);
//	//fwrite(&per, 1, sizeof(per), fp);
//
//	/*char str[20] = "12euyf21981e8yhd";
//	fwrite(str, 1, sizeof(str), fp);*/
//	////从文件指定字符开始读
//	//fseek(fp, -10, SEEK_CUR);
//	//fread(str, 1, sizeof(str), fp);
//	////printf("%s", str);
//	//fseek(fp, -10, SEEK_END);//-10表示倒退10个字符
//	//printf("%s", str);
//
//	//从文件的最后一行开始读//SET头位置，END末尾，CUR当前位置
//	//fseek(fp, 0, SEEK_END);//首先定位到文件末尾
//	////循环读取
//	//char ch = 0;
//	//int len = 0;
//	//while (fread(&ch, 1, 1, fp))
//	//{
//	//	//先读,读完之后定位
//	//	if (ch == '\n')
//	//	break;
//	//	fseek(fp, -2, SEEK_END);
//	//	len++;//统计退了多少格
//	//}
//	//printf("led = %d", len);
//	rewind(fp);//将文件指针重置
//
//	//关闭文件
//	fclose(fp);
//	return 0; 
//}
//
//
//用指针和数字组实现字符串逆序存放
//#include <stdio.h>
//#include <string.h>
////1、数组 
//void string(char* str,int n)
//{
//	int i;
//	char p;
//	for (i = 0; i < n / 2; i++)//一共只要交换一半的首地址就行
//	{
//		p =str[i];//存放从第一个继续的首地址
//		str[i] = str[n-i-1];//例如：0+6-0-1=5->f
//		str[n-i-1] = p;
//	}
//	printf("%s\n", str);
//}
////2、指针
//void string1(char* str,int n)
//{
//	int i;
//	char p;
//	for (i = 0; i < n / 2; i++)//一共只要交换一半的首地址就行
//	{
//		p = *(str + i);//存放从第一个继续的首地址
//		*(str + i) = *(str + n - i - 1);//例如：0+6-0-1=5->f
//		*(str + n - i - 1) = p;
//	}
//	printf("%s\n", str);
//}
//int main(void)
//{
//	char str[] = "abcdef";
//	int n = strlen(str);
//	string(str,n);
//	string1(str,n);
//	return 0;
//}

//#include <stdio.h>
//
//int getMaxResult(int* array, int N)
//{
//	int sum;     //保存两数相乘+1的结果
//	int min  = 0;//保存每次的最小值
//	int temp = 0;//保存最小值所对应的两数的位置
//	//思路：先算数组中两个相邻的数相乘+1的结果最小，重复操作
//	if (N == 1)
//	{
//		return array[0];
//	}
//	else
//	{
//		for (int i = 0; i < N - 1; i++)
//		{
//			sum = array[i] * array[i + 1] + 1;
//			if (i == 0)
//			{
//				min = sum;
//				temp = i;
//			}
//			else
//			{
//				if (sum < min)
//				{
//					min = sum;
//					temp = i;
//				}
//			}
//		}
//	}
//	array[temp] = min;
//	//用后面的覆盖前面的数
//	for (int j = temp; j < N - 2; j++)
//	{
//		array[j + 1] = array[j + 2];
//	}
//	N--;
//	return getMaxResult(array, N);
//}
//
//int main(void)
//{
//	int array[] = { 1,2,3,4,5 };
//	int data = getMaxResult(array, 5);
//	printf("data=%d\n", data);
//	return 0;
//}

//#include <stdio.h>
//int  main(void)
//{
//	/*int a = 10;
//	int* p =&a;
//	int **q = &p;
//	printf("%d", **q);*/
//	int* q = NULL;
//	int* p = NULL;
//	p = q;
//	return 0;
//}


//#include <stdio.h>
//#include <windows.h>
////声明结构体类型
////声明一个类型去描述一个学生的各个属性
//typedef struct stu {
//	char name[10];//学生姓名
//	float score;//学生成绩
//	int id;//学生学号
//}STU;
//
//void stu_add(STU* p);//新增学生
//void xs_input(STU* p, int n);
//void xs_ouput(STU* p);
//void xs_del(STU* p);
//void pai_xu(STU* p);
//void xiu_gai(STU* p);
//int stu_num = 0;//当前学生数量
//int main(void)
//{
//	STU xs[50] = { 0 };//定义了一个元素个数为50 元素类型为STU的结构体数组
//	//用于保存一个班的学生信息
//
//	char in;//接受选择的按键用于判断
//	while (1)
//	{
//		system("cls");//清空缓冲区//清除屏幕
//		printf("***学生管理系统***\n");
//		printf("1:新增学生\n");
//		printf("2:删除学生\n");
//		printf("3:输出信息\n");
//		printf("4:学生成绩排序\n");
//		printf("5:修改信息\n");
//		rewind(stdin);
//		in = getchar();//检测输入值
//		switch (in)
//		{
//		case '1':system("cls"); stu_add(xs); break;
//		case '2':system("cls"); xs_del(xs); break;
//		case '3':system("cls"); xs_ouput(xs); break;
//		case '4':system("cls"); pai_xu(xs); break;
//		case '5':system("cls"); xiu_gai(xs); break;
//
//		}
//	}
//	return 0;
//}
//
////1、新增学生信息(依次填写学生的各个信息，要保存在数组的学生数量的后一位)
//void stu_add(STU* p)
//{
//	printf("请输入新学生的姓名：");
//	rewind(stdin);
//	gets((p + stu_num)->name);//对数组中第num个元素进行赋值
//	printf("请输入新学生的成绩：");
//	scanf_s("%f", &(p + stu_num)->score);
//	printf("请输入新学生的学号：");//若学号存在则重新输入
//	scanf_s("%d", &(p + stu_num)->id);
//	stu_num++;//数量加一
//}
//
////2、删除学生信息(一般采用输入学号，保证删除后留下的学生仍然是连续的)
//void xs_del(STU* p)
//{
//	int id, i, j;
//	int sta = 0;//标志位
//	printf("请输入想要删除的学号:");
//	scanf_s("%d", &id);
//	for (i = 0; i < stu_num; i++)
//	{
//		//遍历所有学生，查看学号
//		if ((p + i)->id == id)
//		{
//			sta = 1;//代表找到该学生
//			//此时确定找到该学生
//			for (j = i; j <= stu_num - 2; j++)//人数少一个num-1
//			{
//				p[j] = p[j + 1];//用后面的覆盖前面的
//			}
//			stu_num--;
//			printf("学生删除成功\n");
//			break;
//		}
//	}
//	//学号不存在
//	if (sta == 0)
//	{
//		printf("学号不存在\n");
//	}
//	printf("输入回车键退出");
//	rewind(stdin);
//	char a = getchar();//给一个阻塞
//}
//
////3、输出学生信息
//void xs_ouput(STU* p)
//{
//	int i;
//	for (i = 0; i < stu_num; i++)//依次输入三个学生的信息
//	{
//		printf("学生%d的姓名：%s\n", i + 1, (p + i)->name);
//		printf("学生%d的成绩：%f\n", i + 1, (p + i)->score);
//		printf("学生%d的学号：%d\n", i + 1, (p + i)->id);
//		printf("\n");
//	}
//	printf("输入回车键退出");
//	rewind(stdin);
//	char a = getchar();
//}
//
//
//
////函数功能：对结构体数组进行输入
//void xs_input(STU* p, int n)
//{
//	int i;
//	//p 数组的首元素地址 p==&xs[0]  p+1==&xs[1]
//	//此时需要注意 xs[0]访问成员为 xs[0].name
//	//       p=&xs[0],p访问成员为  p->name 
//	//       之后依次为           (p+i)->name
//	//       也可以写为			  (*p).name
//	//       之后依次为           (*(p+i)).name
//	for (i = 0; i < n; i++)//依次输入三个学生的信息
//	{
//		printf("请输入学生%d的姓名：", i + 1);
//		rewind(stdin);
//		gets((p + i)->name);
//		printf("请输入学生%d的成绩：", i + 1);
//		scanf_s("%f", &(p + i)->score);
//		printf("请输入学生%d的学号：", i + 1);
//		scanf_s("%d", &(p + i)->id);
//	}
//}
////4、对成绩进行排序，所有信息都交换
////函数功能对输入的成绩排序
//void pai_xu(STU* p)
//{
//	int i, j, k;
//
//	STU q[50];
//	for (k = 0; k < stu_num; k++)
//	{
//		q[k] = p[k];
//	}
//
//	for (i = 1; i <= stu_num - 1; i++)//先对比num-1轮
//	{
//		for (j = 1; j < stu_num - 1 - i; j++)//每轮对比num-i次
//		{
//			if ((q[i].score) > (q[i + 1].score))//升序
//			{
//				STU  b;
//				b = q[i];
//				q[i] = q[i + 1];
//				q[i + 1] = q[i];
//			}
//		}
//	}
//
//	for (i = 0; i < stu_num; i++)
//	{
//		printf("NO.%d\n", i + 1);
//		printf("姓名：%s\n", q[i].name);
//		printf("学号：%d\n", q[i].id);
//		printf("成绩：%f\n", q[i].score);
//	}
//	printf("成绩排序成功\n");
//	printf("输入回车键退出");
//	rewind(stdin);
//	char a = getchar();//给一个阻塞
//}
////5、修改成绩，学号，姓名,是否确认修改
//void xiu_gai(STU* p)
//{
//	//调出所有信息
//	//选择修改学生几的什么信息，例如：学生1的成绩
//	int i, j, id, n;
//	float x1;//重新输入的成绩
//	int x2;//重新输入的学号
//	int sta = 0;
//	printf("请输入你要修改的学生学号\n");
//	scanf_s("%d", &id);
//	for (i = 0; i < stu_num; i++)
//	{
//		//遍历所有学生，查看学号
//		if ((p + i)->id == id)
//		{
//			sta = 1;
//			//此时确定找到该学生
//			printf("请选择你要修改的信息\n");
//			printf("按下1修改成绩，按下2修改学号，按下3修改姓名\n");
//			scanf_s("%d", &n);
//			switch (n)
//			{
//			case 1:
//				printf("请输入新的成绩\n");
//				scanf_s("%f", &x1);
//				(p + i)->score = x1;
//				printf("信息修改成功\n");
//				break;
//			case 2:
//				printf("请输入新的学号\n");
//				scanf_s("%d", &x2);
//				(p + i)->id = x2;
//				printf("信息修改成功\n");
//				break;
//			case 3:
//				printf("请输入新的姓名\n");
//				rewind(stdin);
//				gets((p + i)->name);
//				printf("信息修改成功\n");
//				break;
//			}
//
//		}
//	}
//	if (sta == 0)
//	{
//		printf("学号不存在\n");
//	}
//	printf("输入回车键退出");
//	rewind(stdin);
//	char a = getchar();//给一个阻塞
//}

//字符串转数字atoi
//数字转字符串sprintf

//#include "stdio.h"
//void rm_strcpy(char* buffr, char* bufft);
//int main(void)
//{ 
//	char buff1[] = "abcd";
//	char buff2[] = "efgh";
//	rm_strcpy(buff1, buff2);
//	return 0;
//}
//void rm_strcpy(char* buffr, char* bufft)
//{
//	int i = 0 ;
//	while (*(bufft + i)!='\0')
//	{
//		*(buffr + i) = *(bufft + i);
//		i++;
//	}
//	int j = 0;
//	while (*(buffr + j) != '\0')
//	{
//		printf("%c ", buffr[j]);
//		j++;
//	}
//}

//#include <stdio.h>
//void maopao(int* buff, int len);
//void print(int* buff, int len);
//
//void maopao(int* buff, int len)
//{
//	int i, j;
//	int b = 0;
//	//遍历len-1轮
//	for (i = 0; i < len - 1; i++)
//	{
//		//每轮遍历len-i次
//		for (j = 0; j < len - i-1; j++)
//		{
//			if (*(buff + j) > *(buff + (j + 1)))//升序
//			{
//				b = *(buff + j);
//				*(buff + j) = *(buff + (j + 1));
//				*(buff + (j + 1)) = b;
//			}
//		}
//
//	}
//}
//void print(int* buff, int len)
//{
//	int i;
//	int cnt = 0;
//	for (i = 0; i < len; i++)
//	{
//		printf("%d\t ", buff[i]);
//		cnt++;
//		if (cnt % 10 == 0)
//		printf("\n");
//	}
//}
//int main(void)
//{
//	//组合生成三位数，从小到大输出
//	//定义一个足够大的数组保存所有可能的三位数
//	int  buff[100] = { 0 };
//	int  str[] = { 1,0,5,3,8 };
//	int len = sizeof(str) / sizeof(str[0]);
//	int i,j,k;
//	int p = 0;
//	int bai, shi, ge;
//	int num = 0;
//	//首先1和剩下的4个数任意一个组成一个两位数 ，这个两位数再和剩下的3个数组合成一个三位数
//	//且0不能在百位，不能三个数有重合的
//	//暴力for,第一层遍历百位数
//	for (i = 0; i < len; i++)
//	{
//		bai = str[i];
//		//0不能在百位
//		if (bai == 0)
//		{
//			continue;
//		}
//		num = bai * 100;
//		//第二层for遍历十位数
//		for (j = 0; j < len; j++)
//		{
//			shi = str[j];
//			//如果该数值已经被百位占了，十位就不能等于该数字
//			if (shi == bai)
//			{
//				continue;
//			}
//			num = num + shi * 10;
//			//第三层for遍历个位数
//			for (k = 0; k < len; k++)
//			{
//				ge = str[k];
//				//如果该数值已经被百位,或者十位占了，个位就不能等于该数字
//				if (ge == bai||ge == shi)
//				{
//					continue;
//				}
//				num = num + ge;
//				//循环存储每一个生成的三位数
//				buff[p++] = num;
//				//数据存储完成后num=第二层循环的num便于下一次存储
//				num = num-ge;
//			}
//			//数据存储完成后num=第一层循环的num便于下一次存储
//			num = num - shi*10;
//		}
//		//数据存储完成后num清零便于下一次存储
//		num = 0;
//	}
//	//以上三层循环后所有的三位数都在数组buff中，再排序从小到大输出
//	//maopao(buff,48);
//	print(buff, 48);
//	return 0;
//}

//#include <stdio.h>
////二分查找
////贪心算法
//// 
////#define SECONDS_PER_YEAR (60*60*24*365)UL 
//int main(void)
//{
//
//return 0;
//}
